const answersText = `
过程话SQL的特点是（ ）。:::C
The data（）includes the function of updating data on a database， and retrieving data from a database.:::A
（ ）has become a fact of modern life， with millions of people now shopping on-line.:::B
（ ）of database refers to the protection  of data against unauthorized  disclosure， alteration，or destruction.:::A
When all modules have been completed and tested, （）is performed to ensure that the modules operate together correctly.:::B
（）is the delivery of different services through the Internet, including data storage, servers, databases, networking, and software.:::C
As each application module is completed, it undergoes （ ） to ensure that it operates correctly and reliably.:::A
The line of computing jobs waiting to be run on a computer system might be a （）．The jobs are serviced in the order of their arrival， that is， the first in is the first out．:::A
In（）programming ， the user determines the sequence of instructions to be executed， not the programmer.:::D
Integration （ ）is the process of verifying that the components of a system work together as described in the program design and system design specifications.:::C
（）：The process of identifying and correcting errors in a program.:::A
（）：A location where data can be temporarily store（D）:::C
（ ）：A graphical bar with buttons that perform some of the most common commands.:::B
软件工程是指（）。:::A
一组无逻辑关系的语句在程序中多处出现，为了节省存储空间，把这些语句放在一个模块中，该模块的内聚是（）。:::B
软件工程的基本目标是（ ）。:::B
在软件生存周期中,时间最长、所花费的精力和费用也最多的阶段是（）。:::C
软件生存周期是指（）。:::D
通过程序设计活动求解问题时，通常可分为问题建模、算法设计、编写代码和编译调试四个阶段。（ ）阶段的工作与所选择的程序语言密切相关。:::D
某模块中各个处理元素都密切相关于同一功能且必须顺序执行，前一处理元素的输出就是下一处理元素的输入，则该模块的内聚类型为（）内聚。:::C
某开发小组为某企业开发较大规模的项目，该开发小组已经为同一行业的其他企业开发过类似的项目，且该项目需求变化很少，则最适宜采用（ ）开发过程模型。:::A
螺旋模型是一种（）的软件开发模型。:::B
通常企业在信息化建设时需要投入大量的资金，成本支出项目多且数额大。在企业信息化建设的成本支出项目中，系统切换费用属于（）。:::D
软件工程项目质量管理不包括 （）。:::D
软件开发过程中，项目管理的目标不包括（ ）。:::D
在Java语言中，类名应该使用（）命名法。:::A
在C语言中，函数名应该使用（ ）命名法。:::B
在任何语言中，变量名应该（ ）。:::B
（）不属于良好的编码风格。:::C
良好的编程（）使阅读代码更容易。:::B
编码规范是指（）。:::B
行内注释是指（）。:::C
注释规范是指（）。:::A
文件注释是指（）。:::A
文档规范是指（）。:::B
文档规范的好处有（）。:::C
文档规范的类型有（）。:::D
系统实施的目的是（）。:::D
系统转换最安全的方式是（）。:::A
系统日常运行管理内容中的（ ）是指系统中设置了自动记录功能，能通过自动记录的信息发现或判明系统的问题和原因。:::D
信息系统维护的主要内容包括系统应用程序维护、（）、代码维护、硬件设备维护和文档维护。:::A
信息系统维护的最主要内容之一（），它是指对相应的应用软件及有关文档进行的修改和完善。:::B
系统应用程序维护中的（ ）指的是，使应用软件适应外界环境变化和管理需求变化而进行的修改。:::C
系统维护的重点是系统应用软件的维护工作，按照软件维护的不同性质划分为四种类型，即（）。:::D
为了进一步改善软件系统的可维护性和可靠性，并为以后的改进奠定基础的软件维护称为（）。:::A
根据对各种维护工作分布情况的统计结果，软件维护工作的最主要部分是（）。:::B
（）的目的是为了估计系统的技术能力、工作性能和系统的利用率等，其度量了系统当前的性能并为进一步改善未来的系统提供依据。:::C
在评价一个信息系统时，最重要的是建立评价指标体系，它既包括了信息系统开发运行者，也就是信息系统主体，也包括信息系统的直接用户即信息系统的客体，更包括（ ）。:::D
信息系统的安全保密性评价一般属于系统评价技术指标中的（）评价。:::A
一个优秀的概念设计不包含（   ）。:::C
属于程序设计语言的类型的选项是（）。:::A
用（）来描述算法时，可以采用类似于程序设计语言的语法结构，也易于转换为程序。:::D
用某高级程序设计语言编写的源程序通常被保存为（ ）。:::B
将多个目标代码文件装配成一个可执行程序的程序称为（）。:::D
程序代码编写方案是指（）。:::A
程序代码编写方案的好处有（）。:::D
程序代码编写方案的类型有（）。:::B
自上而下的程序设计方案是指（ ）。:::A
面向对象的程序设计方案是指（ ）。:::A
模块化的程序设计方案是指（ ）。:::A
所谓（）就是可以自由而且免费的使用该软件，并拷贝给别人，而且不必支付任何费用给程序的作者，使用上也不会出现任何日期的限制或是软件使用上的限制。:::D
当您拷贝免费软件给别人的时候，必须将完整的软件档案拷贝给他人，同时（）。:::A
免费软件使用上（ ）。:::B
以“先使用后付费”的方式销售的享有版权的软件是（）。:::C
共享软件使用上（）。:::D
按照软件的授权方式，可以分为商业软件、共享软件和（ ）。:::A
（）被定义为描述其源码可以被公众使用的软件，并且此软件的使用，修改和分发也不受许可证的限制。:::B
开源软件的开发方式通常是（）。:::B
开源软件的优势有（）。:::C
软件许可证是一种（），由软件作者与用户签订，用以规定和限制软件用户使用软件或其源代码的权利，以及作者应尽的义务。:::A
一旦与软件开发商达成协议，签订合同后可终身无限制的使用该软件的许可证是（）。:::B
商业软件许可证是指（ ）。:::A
计算机信息系统的安全保护，应当保障（），运行环境的安全，保障信息的安全，保障计算机功能的正常发挥，以维护计算机信息系统的安全运行。:::B
互联网上的（）是指互联网上一切可能对现存法律秩序和其他公序良俗造成破坏或者威胁的数据、新闻和知识等信息。:::C
（ ）是指编制或者在计算机程序中插入的破坏计算机功能或者毁坏数据，影响计算机使用，并能自我复制的一组计算机指令或者程序代码。:::D
涉及（）的计算机信息系统，不得直接或间接地与国际互联网或其他公共信息网络相连接，必须实行物理隔离。:::A
《互联网信息服务管理办法》对经营性和非经营性互联网信息服务实行以下制度：（ ）。:::B
我国计算机信息系统实行（）保护。:::C
通过（ ）方式是可以合法收集个人信息的。:::C
在公共场所安装图像采集、个人身份识别设备所收集的个人图像、身份识别信息只能用于（）的目的，不得用于其他目的；取得个人单独同意的除外。:::C
以下哪一项收集个人信息的途径是合法的（）。:::C
非法获取、出售公民个人信息，情节严重的（）。:::A
非法收集个人信息的处罚是（ ）。:::C
设立用于非法获取、出售或者提供公民个人信息违法犯罪活动的网站、通讯群组，情节严重的，以非法利用信息网络罪定罪处罚；同时构成侵犯公民个人信息罪的，以（）处罚。:::C
恶意代码传播速度最快、最广的途径是（）。:::D
病毒和木马的出现证明在无线平台上生产恶意代码是有可能的，而且病毒在无线环境下可能传播更快，这属于移动商务面临的（）威胁。:::B
（）不足以说明病毒是网络攻击的有效载体。:::D
网页恶意代码通常利用（）来实现植入并进行攻击。:::B
（）病毒没有自我复制功能。:::A
为了防止电子邮件中的恶意代码，应该由（）方式阅读电子邮件。:::A
（）选项不属于恶意代码分析方法。:::C
（ ）信息不是特洛伊木马所窃取的。:::D
（ ）选项属于恶意代码静态分析技术。:::B
应用安全防护技术，主要包括工业互联网（）安全防护技术和工业应用软件安全防护技术。:::D
下面哪项不属于应用安全（）:::D
工业互联网安全防护内容具体包括：设备安全、控制安全、网络安全、（）和数据安全。:::C
云存储系统通过集群应用和分布式存储技术将大量不同类型的存储设备集合起来协调工作，提供企业级数据存储、管理、业务访问、高效协同的应用系统及存储解决方案。对云存储系统的要求不包括（ ）。:::C
数字信封技术能够（）。:::A
若连接数据库过程中需要指定用户名和密码，则这种安全措施属于（ ）。:::D
网络安全的基本目标包括（）。:::A
`;
