const answersText = `
（ ）攻击方式是利用网络协议的缺陷或者设计漏洞进行的。:::B
（）加密算法是一种对称加密算法。:::B
国家建立和完善网络（）。:::A
网络运营者应当对其收集的用户信息（），并建立健全用户信息保护制度。:::B
（）是指通过网络收集、存储、传输、处理和产生的各种电子数据。:::A
网络产品、服务的提供者不得设置（）；发现其网络产品、服务存在安全缺陷、漏洞等风险时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。:::B
国家支持企业、研究机构、高等学校、（）组织参与网络安全国家标准、行业标准的指定。:::D
关键信息基础设施的运营者违反网络安全法第三十五条规定，使用未经安全审查或者安全审查未通过的网络产品或者服务的，由有关主管部门责令停止使用，处采购金额在（ ）罚款；对直接负责的主管人员和其他直接责任人员处一万元以上十万元一下罚款。:::A
通过继承取得著作权的人，不能享有的权利是（）。:::A
专利权的地域性是指在（）拥有法律保护。:::B
含有保护期限不受时间限制的知识产权的是（）。:::B
知识产权法的渊源一般分为两类，是指（）。:::B
发明专利的保护期是20年，起算日期为（）。:::A
一项发明或实用新型获得专利授权的实质条件是（）。:::C
软件设计包括（）两个阶段。:::B
概要设计的目的是确定整个系统的（）。:::D
数据流图用于抽象描述一个软件的逻辑模型,数据流图由一些特定的图符构成。不属于数据流图合法图符的是（）。:::B
概要设计的主要成果是（）。:::C
系统流程图是描述（）的工具。:::D
在数据库设计中，用E-R图来描述信息结构但不涉及信息在计算机中的表示，它是数据库设计的（）阶段。:::B
需求分析是分析员经了解用户的要求,认真细致地调研、分析,最终建立目标系统的逻辑模型并写出（ ）的过程。:::D
E-R图是数据库设计的工具之一，它适用于建立数据库的（）。:::A
螺旋模型是一种将瀑布模型和（）结合起来的软件开发模型。:::B
数据耦合和控制耦合相比,则（）成立。:::B
瀑布模型不适合用于（）的软件开发。:::A
下面不属于软件设计原则的是（）。:::B
当一个模块直接使用另一个模块的内部数据时,这种模块之间的耦合为（）。:::C
概要设计与详细设计衔接的图形工具是（ ）。:::C
SD方法是建立良好程序结构的方法，它提出衡量模块结构质量的标准、块间联系与块内联系，SD方法的最终目标是（）。:::B
在SD方法中全面指导模块划分的最重要的原则是（）。:::D
结构化设计方法是一种基于模块化和自顶向下的设计原则的软件设计方法，它主要使用（ ）图形工具来表示软件结构。:::A
结构化程序设计的一种基本方法是（）。:::D
结构化分析方法（SA法）使用的主要描述工具有（）。:::D
软件结构图的形态特征能反映程序复用率的是（）。:::C
软件层次图（H图）中一个方形的方块代表一个（）。:::A
模块间的调用关系，用联结两模块的（ ）表示。:::C
层次图用来描绘软件的层次结构，很适于在（）设计软件的过程中使用。:::B
结构化设计是一种面向数据流的设计方法，以下不属于结构化设计工具的是（）。:::C
HIPO图中的H图称为（）图。:::D
绘制HIPO图时（ ）步骤是不正确的。:::D
在面向对象设计中，（）是用来描述具有相同的属性和方法的对象的集合:::B
（）开发方法能够兼顾功能和数据。:::D
在面向对象软件开发方法中，类与类之间主要有（）结构关系。:::A
面向对象设计中，“设计抽象的接口”的含义是（）。:::B
面向对象设计的核心是使用（）来进行程序设计。:::A
面向对象设计方法中，开闭原则的含义是（ ）。:::B
面向对象的特征中，（）是指在确定系统的某一部分内容时，应考虑到其它部分的信息及联系都在这一部分的内部进行，外部各部分之间的信息联系应尽可能的少。:::A
以面向对象的特征中，（）是指不同类的对象对同一消息做出不同的响应，或者说，同一个方法在不同的对象中有不同的实现方式。:::D
（）是表达系统类及其相互联系的图示，它是面向对象设计的核心，建立状态图、协作图和其他图的基础。:::C
对象实现了数据和操作的结合，使数据和操作（）于对象的统一体中。:::C
对象的（）是对象的动态特征。:::D
（ ）不属于面向对象分析模型。:::C
开发视图描述软件在开发环境下的（）。:::A
开发视图关注程序包，不仅包括要编写的（ ），还包括可以直接使用的第三方SDK和现成框架、类库，以及开发的系统将运行于其上的系统软件或中间件。:::B
开发视图一般使用（）、类图和组件来画。:::D
场景视图，又称“（）视图”，它综合所有的视图。:::A
场景表示法与组件逻辑视图非常相似，但它使用（）的连接符来表示对象之间的交互，对象实例使用实线来表达。:::C
场景视图用于刻画构件之间的（），将四个视图有机地联系起来。:::B
概要设计的主要任务是把需求分析得到的系统扩展用例图转换为软件结构和数据结构，建立的是目标系统的（ ）模型。:::A
为了防止软件概要设计的错误传播到开发的后续阶段，在概要设计文档完后，要进行（）。:::B
软件概要设计阶段通常得到（）。:::D
软件详细设计阶段任务是（）。:::A
软件详细设计阶段属于软件生存周期的（）。:::B
详细设计与概要设计衔接的图形工具是（）。:::D
软件详细设计阶段采用自左向右的二维图形结构描述算法的是（ ）。:::C
结构化程序设计主要强调的是（）。:::D
详细设计的结果基本决定了最终程序的（）。:::C
一般来说，详细设计的方法包括结构化设计方法、（）和Jackson方法。:::C
Jackson方法是以（）为基本依据的程序算法设计方法。:::B
Jackson方法可以实现（ ）。:::D
（ ）不是详细设计时使用的工具。:::A
在详细设计阶段，经常采用的工具有（）。:::A
（）工具在软件详细设计过程中不采用。:::D
程序流程图中的“→”代表（）。:::B
程序流程图中的一般包括三种基本结构，（）结构不属于其基本结构。:::D
程序流程图中的菱形表示的是（）。:::C
（）不属于盒图的用途。:::C
盒图中，（ ）结构可以实现先执行后判断的循环。:::D
（）是用作详细设计的工具。:::D
PAD图为（）提供了有力的工具:::D
在PAD图中，（）符号属于PAD图的基本符号。:::B
在PAD图中，（）符号不属于PAD图的基本符号。:::D
程序流程图、N-S图和PAD图是（）使用的表达工具。:::B
PAD图表示的程序结构的执行顺序是 （ ）。:::A
在N-S流程图中，输入/输出、数据处理、条件判断等都由（）框来表示。:::C
定表是分析和表达 （） 的工具。:::A
判定表中贯穿条件项和动作项的一列称为 （）。:::A
判定表中用符号“-”表示 （）。:::A
判定树是用一种 （） 来表示多个条件、多个取值所应采取的动作。:::B
判定树中每个非终端结点包含一个 （ ），对应一次比较。:::A
判定树与判定表相比，其优点是 （ ）。:::B
PDL（过程设计语言）是描述处理过程（）。:::C
过程设计语言(简称PDL)，也称程序描述语言，又称为（）。:::D
过程设计语言是一种用于描述软件系统的行为和结构的语言，它可以分为（ ）。:::A
JACKSON图中一般不包括（ ）。:::D
Jackson图上下层之间的关系是（）。:::B
Jackson程序设计方法是一种面向（）的设计方法。:::A
在流图中，用（）表示语句。:::C
在流图中，用（）表示判断。:::A
程序流图中箭头代表的是（）。:::B
`;
