const answersText = `
错误推测法的缺点是难以系统化，并且过度依赖个人能力。（ ）:::A
因果图法是利用“关键的少数和次要的多数”的原理。（ ）:::B
判定表是由条件桩、动作桩、条件项和动作项组成的。（ ）:::A
通过正交试验法能够减少测试用例数量。（ ）:::A
场景法中的基本流是模拟用户错误的操作流程。（ ）:::B
对于业务流清晰的系统，可以利用功能图法贯穿整个测试案例过程。（ ）:::B
测试用例的设计和编制是软件测试活动中最重要的。（ ）:::A
每一测试用例都有相应的期望结果。（ ）:::A
测试用例可以分为基本事件、非基本事件和异常事件。（ ）:::B
测试结果的可操作性,即测试执行结果的正确性是可判定的，每一个测试用例都应有相应的期望结果。（ ）:::B
测试全面不等于全面测试。（ ）:::A
测试用例按复杂度顺序执行。（ ）:::B
 测试用例集需要不断地变更和维护，使之与产品的变化保持一致。（ ）:::A
 如果让手工做重复的测试，容易引起测试人员的乏味，严重影响工作情绪等。（ ）:::A
 使用测试工具进行测试就等于自动化测试。（ ）:::B
 自动化软件测试工具存在的价值是为了提高测试效率。（ ）:::A
 软件测试按照功能划分可以分为静态测试和动态测试。（ ）:::B
 在投资有限的情况下，性能测试自动化产品将优先于功能测试自动化被考虑。（ ）:::A
 为了最大限度的灵活性，JMeter允许使用正则表达式创建断言。（ ）:::A
 JMeter是Apache组织的开放源代码项目，只能做性能测试。（ ）:::B
 SilkTest是一个可以用于攻击Web应用程序的集成平台。（ ）:::B
 一个完善的缺陷跟踪管理系统对于测试的成功实施是非常重要的。（ ）:::A

 职业道德是从业者在职业活动中应该遵循的符合自身职业特点的（）。:::A

 （ ）是从业者在职业活动中应该遵循的符合自身职业特点的职业行为规范。:::B

 职业道德的真正形成是在（）社会。:::C

 社会主义职业道德的核心思想是（）。:::D

 （）是集体主义精神的最高表现，而坚持集体主义原则则是全心全意为人民服务的本质要求。:::A

 职业道德是社会道德（ ）。:::C

 家庭美德是每个公民在家庭生活中应该遵循的准则，家庭关系包括了（ ）。:::D

 个人的良好的道德品质是（）。:::A

 职业道德行为规范包括职业道德基本行为规范和（ ）。:::B

 职业道德行为规范包括（ ）和职业道德特殊行为规范。:::C

 具有从业人员自身职业特点的职业道德行为准则是（）。:::D

 履行岗位职责的最高表现形式是（）。:::A

 从业人员对爱岗敬业的准确理解应该是（ ）。:::B

 爱岗敬业是职业道德的核心和基础，（ ）不属于爱岗敬业的行为表现。:::C

 敢讲真话，坚持真理，敢于与掺杂使假、坑蒙拐骗的行为做斗争，以实际行动来维护（ ）的道德规范。:::D

 （）就是对待同事，甚至竞争对手谦和礼让、大肚能容，不能小肚鸡肠、斤斤计较。:::A

 党的十九大报告在加强思想道德建设中指出，“要推进诚信建设和志愿者服务制度化，强化（ ）”。:::B

 办事公道要求做到（）。:::C

 办事公道的基本要求不包括（）。:::D

 服务群众的核心内容是（）。:::A

 （ ）体现了从业人员自觉自愿、无私无畏为社会做贡献的人生态度，以为人民服务为乐的精神。:::B

 （ ）体现了从业人员为祖国、为人民竭尽全力，甚至不惜牺牲生命的社会责任感。:::C

 孔子说：“其生正,不令而行,其身不正,虽令不从”，说明了道德行为规范的（）。:::D

 （ ）是指个人在政治、思想、道德品质、知识技能方面，经过学习和自我锻炼所达到的水平。:::A

 做到开拓创新的人，一般是（ ）。:::B

 勤奋学习是指（）。:::C

 已故国家副主席宋庆龄说过“不管你预备走哪一条路,顶顶要紧的是先要为自己做好准备。你不能赤手空拳地开始你的行径,你必须用知识把自己武装起来。”说明了职业道德行为规范的（ ）。:::D

 愚公移山的故事说明了（）。:::A

 正确的职业道德与职业技能的关系是（ ）。:::B

 （）是产品、建设工程、服务行业的生命，也是信誉的先觉条件。:::C

 质量是产品、建设工程、服务行业的生命，也是（ ）的先觉条件。:::D

 （）距今已有近1400年，它经受了洪水冲击、地震摇撼和风化腐蚀等考验，至今仍完整地保持着桥基、桥身的原来结构，宋代杜德源赞誉为“坦平箭直千人过，驿使驰驱万国通。”:::A

 与法律相比，道德具有（）的特点。:::B

 要做到遵纪守法，对每个职工来说，必须做到（ ）。:::C

 文明安全的生产制度是劳动者必须遵守的法律法规、规章制度，是企业实现安全生产的重要（）。:::D

 “单丝不成线、独木不成林”说明了（ ）。:::A

 在充满竞争的现代社会中，正确对待竞争时应该保持的健康心态是（ ）。:::B

 “人心齐，泰山移”，“众人齐心，黄土变金”，这样的雅言俗语都揭示了（）的巨大作用。:::C

 孔子看见他的学生宰予“昼寝”,就说“朽木不可雕也。”其用意是（）。:::D

 “半丝半缕，恒念物力维艰”体现的理念是（ ）。:::A

 荀子讲“强本而节用，则天不能贫。”这句话正确的理解是（ ）。:::B

 计算机程序设计员的职业道德核心原则是应当以（）为最高目标。:::C

 计算机程序设计员利用公司的技术和关系促进自己的业务发展，在职业道德范畴属于（）。:::D

 计算机程序设计员应当积极参与（），紧跟信息技术发展速度，促进职业生涯发展。:::A

 程序设计语言的定义一般包括（）三个方面。:::D

 语义是程序语言中按语法规则构成的各个语法成分的含义，其中（）指编译时可以确定的语法成分的含义。:::A

 （）表示了构成语言的各个记号和使用者的关系，涉及符号的来源、使用和影响。:::B

 （）始于从模拟领域发展起来的Simula，在该语言中首次提出了对象和类的概念。:::D

 （）是基于动作的语言，在这种语言中，计算被看成动作的序列。:::A

 （）是程序操作的对象，具有类型、名称、作用域、存储类别和生存期等属性，在程序运行过程中要为它分配内存空间。:::B

 控制成分指明语言允许表述的控制结构，程序员使用控制成分来构造程序中的控制逻辑，理论上已经证明，可计算问题的程序都可以用（ ）这三种控制结构来描述。:::D

 （）基本包括并、差、交、选择、投影、连接、除法、外连接等，有些查询需要几个基本运算的组合，要经过若干步骤才能完成。:::B

 函数是程序模块的主要成分，它是一段具有独立功能的（）。:::C

 函数的使用涉及三个概念：（ ）。:::D

 函数的定义描述了函数做什么和怎么做，包括两部分（）。:::A

 计算机识别、存储和加工处理的对象被统称为（）。:::B

 数据结构通常是研究数据的（）及它们之间的联系。:::C

 数据结构是一种具有一定逻辑关系，在计算机中应用某种存储结构，并且封装了相应操作的数据元素集合，它包含三方面的内容，逻辑关系、存储关系及（）。:::D

 数据结构有很多种，一般来说，按照数据的逻辑结构对其进行简单的分类，包括（）两类。:::B

 常用的线性结构有线性表、栈、队列、双队列、数组和（）等。:::C

 结点按逻辑关系依次排列形成一条“锁链”的数据结构是（ ）。:::D

 （）的逻辑特征是一个结点元素可能有多个直接前驱和多个直接后继。:::A

 常见的非线性结构有二维数组，多维数组，广义表和（）等。:::B

 （ ）是一种重要的非线性数据结构，直观地看，它是数据元素按分支关系组织起来的结构。:::C

 数据结构中的（）的目的，是为了更有效的处理数据，提高数据运算效率。:::C

 算法研究的目的是为了更有效的处理数据，提高数据运算效率，其中数据的运算是定义在数据的（ ）上。:::D

 算法分析的两个主要方面是（）。:::A

 数据库概念结构设计的任务是在需求分析阶段产生的需求说明书的基础上，按照特定的方法把它们抽象为一个不依赖于任何具体机器的数据模型，即（）。:::A

 概念模型是现实世界的第一层抽象，这一类模型中最著名的模型是（）。:::B

 E-R图是数据库设计的工具之一，它一般适用于建立数据库的（）。:::C

 （）是将概念结构设计阶段完成的概念模型，转换成能被选定的数据库管理系统支持的数据模型。:::D

 在关系数据库设计中，设计关系模式属于数据库设计的（）阶段。:::A

 在关系数据库设计中，将E-R图转换到关系模式时，实体与联系都可以表示成（）。:::B

 嵌入式SQL是一种将SQL语句直接写入C、C++、Java等编程语言的源代码中的方法，在这一方法中，将SQL文嵌入的目标源码的语言称为（）。:::C

 嵌入式SQL的预处理方式，是指（ ）。:::D

 在嵌入式SQL中，为了把集合操作转换成单记录处理方式，引进了（）。:::A

 Oracle的PL/SQL、Microsoft SQL Server的Transcat-SQL、IMB DB2的SQL PL等是对SQL的扩展，使其增加了（）功能。:::B

 过程化SQL程序的基本结构是（）。:::C
`;
