const answersText = `
职业道德是从业者在职业活动中应该遵循的符合自身职业特点的职业行为规范。（ ）:::A
社会主义职业道德的指导原则是为人民服务。（ ）:::B
职业道德与个人品德是互相影响、互相促进的正相关关系。（ ）:::A
“爱国守法、明礼诚信、团结友善、勤俭自强、敬业奉献”的公民基本道德规范育“爱岗敬业、诚实守信、办事公道、服务群众、奉献社会”的职业道德规范没有内在关系。（ ）:::B
爱岗敬业、忠于职守就要干一行，爱一行，终身只能从事某职业。（ ）:::B
服务群众最终要达到的最佳效果是优质服务。（ ）:::A
奉献社会，不光是为了名和利，也为了有益于他人，有益于国家和社会。（ ）:::B
创新是个人事业成功的保障，创新蕴含着巨大的经济价值和社会价值。（ ）:::A
精通业务与职业道德无关。（ ）:::B
产品质量、安全生产有相应的法律规定，因此不属于职业道德规范。（ ）:::B
维护公共秩序和保护生态环境应该从我做起，勿以恶小而为之。（ ）:::A
现代企业的团队精神属于行业职业道德规范之一。（ ）:::A
勤俭节约只是我国的传统美德，只是体现在家庭美德上，和职业道德没有关系。（ ）:::B
计算机程序设计员对其同行应持团结协作、互帮互助的态度。（ ）:::A
语法是指由程序设计语言的基本符号组成程序中的各个语法成分的一组规则，其中由基本字符构成的符号书写规则称为词法规则，由符号构成语法成分的规则称为语法规则。（ ）:::A
逻辑型语言是一类以形式逻辑为基础的语言，其代表是建立在关系理论和一阶谓词理论基础上的PASCAL。（ ）:::B
按照程序运行时数据的值能否改变，将数据分为常量和变量；按作用域可将变量分为全局变量和局部变量。（ ）:::A
函数的声明与函数的定义形式上十分相似，都需要开辟内存，但声明不包含函数体。（ ）:::B
数据结构是带“结构”的数据元素的集合，即相互之间存在一种且只有一种特定关系的数据元素的集合。（ ）:::B
线性结构中所有数据元素均有唯一的“后继”。（ ）:::B
有一个以上根结点的数据结构一定是非线性结构。（ ）:::A
概念模型使设计者的注意力能够从最重要的信息的组织结构和处理模式上解脱出来，而只集中在复杂的实现细节中。（ ）:::B
数据库逻辑结构设计的结果是唯一的。（ ）:::B
宿主语言，是开发宿主环境的程序语言，比方说你用VC做数据库，那么SQL就是宿主语言，它是C++的宿主。（ ）:::B
过程化SQL基本结构是块，块可以嵌套，每个块完成一个逻辑操作。（ ）:::A
Operating system first appeared during the third computer generation.（ ）:::A
When writing data to memory,the CPU first outputs the data onto the data bus,then outputs the address onto the address bus.（ ）:::B
A virus infected computer may lose its data.（ ）:::A
软件产品的发布时间应由测试团队来决定。（ ）:::B
软件生存周期是从软件开始开发到开发结束的整个时期。（ ）:::B
程序设计的一般原则包括先进行内部设计，再设计外部接口。（ ）:::B
软件开发过程中为确保软件质量所采取的措施中，不包括用户应参与开发全过程，并监督开发质量。（ ）:::A
涉及物理状态或含有物理意义的常量，提倡直接使用数字，因为这些是众所周知的，没有必要再进行常量的定义。（ ）:::B
建议把多个短语句写在一行便于阅读。（ ）:::B
只有一些复杂的代码需要注释说明。（ ）:::B
信息系统运行方式可采取全内部方式、全外包方式和部分外包方式，不同形式的采取主要取决于企业的业务主流、技术储备和经济考虑。（ ）:::A
信息系统数据维护主要包括数据库维护、数据文件维护和信息编码维护等内容。（ ）:::A
信息系统评价方法主要有定量/定性方法和动态/静态方法。（ ）:::A
在对高级语言编写的源程序进行编译时，可发现源程序中的全部语法错误和全部语义错误。（ ）:::B
为提高程序的可读性，程序中的注释应重点解释程序中各语句的语义。（ ）:::B
编译是将高级语言源代码转换成目标代码的过程，解释是将高级语言源代码转换为目标代码的过程。在编译方式下，用户程序运行的速度更快。（ ）:::A
免费软件可以未经程序作者的同意，自由修改该软件的程序代码。（ ）:::B
共享软件受版权法保护。（ ）:::A
开源软件就是代码公开的软件。（ ）:::A
常用的软件许可证包括：GPL许可证、BSD许可证、私权软件许可证等。（ ）:::A
计算机病毒疫情，是指某种计算机病毒爆发、流行的时间、范围、破坏特点、破坏后果等情况的报告或者预报。（ ）:::A
计算机信息系统实行安全等级保护，安全等级的划分标准和安全等级保护的具体办法，由工信部会同有关部门制定。（ ）:::A
网络服务提供者和其他企业事业单位在业务活动中收集、使用公民个人电子信息，应当遵循合法、正当、必要的原则，明示收集、使用信息的目的、方式和范围，并经被收集者同意，不得违反法律、法规的规定和双方的约定收集、使用信息。（ ）:::A
违反国家有关规定，通过购买、收受、交换等方式获取公民个人信息，或者在履行职责、提供服务过程中超范围收集公民个人信息的，均可能构成侵犯公民个人信息罪。（ ）:::A
通过修改某种已知计算机病毒的代码，使其能够躲过现有计算机病毒检测程序时，可以称这种新出现的计算机病毒是原来计算机病毒的变形（ ）:::A
木马程序通常称为木马，恶意代码等，是指潜伏在电脑中，可接收外部用户控制以窃取本机信息或控制权的程序。（ ）:::A
恶意代码检测申请人定期组织常规性恶意代码检测工作。（ ）:::A
安全预评价是指在项目建设前应用安全评价的原理和方法对系统的危险性、危害性进行预测性评价（ ）:::A
数据的安全性是指保护信息和信息系统不受到未经授权的获取、使用、泄漏、毁坏、更改或破坏。（ ）:::A
DES是共享密钥加密算法。（ ）:::A
任何个人和组织不得从事非法入侵他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动。（ ）:::A
网络运营者应当对其收集的用户信息严格保密，并建立完善用户信息保护制度。（ ）:::B
作者的传播权包括表演者权、录制者权、广播组织权、出版者权。（ ）:::A
在我国，注册商标在期满前6个月内没有申请续展注册的，可以给予9个月的宽展期。（ ）:::B
概要设计的主要任务是把需求分析得到的 DFD 转换为软件结构和数据结构。（ ）:::A
软件设计说明书是软件概要设计的主要成果。（  ）:::B
概要设计的过程也就是将需求分析之中产生的功能模型、数据模型和行为模型等分析结论进行转换，由此产生设计结论的过程。（ ）:::A
概要设计需要注意用来检查设计的模块是否完整，保证每一个功能都有对应的模块来实现。（ ）:::A
概要设计要遵循的原则有：模块化；抽象；自顶向下，逐步细化；信息隐蔽；模块独立性。其中，模块独立性是最核心的原则。（ ）:::A
SD法是一种面向数据结构的设计方法，强调程序结构与问题结构相对应。（ ）:::B
模块结构图是用于描述系统模块结构的图形工具，不仅描述了系统的子系统结构与分层的模块结构，还清楚地表示了每个模块的功能。（ ）:::A
层次图又叫H图，适于在自顶向下设计软件的过程中使用。（ ）:::A
HIPO法既是需求分析方法，又是软件设计方法。（ ）:::A
面向对象方法是一种把面向对象的思想应用于软件开发过程中，指导开发活动的系统方法，简称OO，是建立在“对象”概念基础上的方法学。（ ）:::A
面向对象设计思想包括设计对象重构，抽象基础设计，继承化设计和多态性设计。（ ）:::A
逻辑视图设计的首要准则是在全系统中保持单一、一致的对象模型，避免在此引入不同场景和处理过程中产生各种类和机制的特例化。（ ）:::A
进程视图侧重于系统的运行特性，主要关注一些非功能性需求。（ ）:::A
开发视图和逻辑视图之间可能存在一定的映射关系。（ ）:::A
场景视图是其他视图的冗余，但作为一项驱动因素来发现架构设计过程中的架构元素。（ ）:::A
详细设计对应于集成测试，是设计集成测试用例的主要依据；概要设计对应于单元测试，是设计单元测试用例的主要依据。（ ）:::B
软件详细设计要确定接口的细节，为每一个模块设计出一组测试用例。（ ）:::A
详细设计阶段是为每个模块完成的功能进行具体的描述，要把功能描述转变为精确的、结构化的过程描述。（ ）:::A
结构化程序设计采用的思想是递归法。（ ）:::B
详细设计处理过程常用三种工具：图形、表格和语言。（ ）:::A
盒图是最悠久、使用最广泛的描述过程设计的方法。（ ）:::B
PAD图用二维树形结构表示。（ ）:::A
N-S图包括顺序结构、条件结构、循环结构。（ ）:::A
判定树的作用是以图形的形式描述复杂的条件组合与对应处理之间的关系。（ ）:::A
PDL是一种用于描述功能模块的算法设计和加工细节的语言。（ ）:::A
Jackson图只能表达程序结构，不能表达数据结构。（ ）:::B
在程序流程图中，用标有名字的箭头表示控制流。（ ）:::A
mccabe度量基于一个程序模块的程序图中环路的个数。（ ）:::A
Halstead方法是根据程序中的运算符和分支的总数来度量程序的复杂程度。（ ）:::B
在设计软件的模块结构时, 完善模块的功能不能改进设计质量。（ ）:::A
需求分析阶段研究的对象是软件项目的工程要求。（ ）:::B
控制系统总体方案的确定包括确定控制系统方案、选择开闭环控制、选择测量元件和选择执行机构。（ ）:::A
接口不可以继承类。（ ）:::A
数据库设计的过程中，通常需要先进行需求分析，然后进行概念结构设计，再进行逻辑结构设计，最后进行物理结构设计。（ ）:::A
系统出错处理的目的是提高系统的可靠性和可用性，而不是提高系统的性能和效率。（ ）:::A
结构化查询语言SQL是非关系型数据库的标准语言。（ ）:::B
MySQL允许定义任意级别的字符集和校对规则，支持服务器、数据库、表、列等级别的字符集和校对规则。（ ）:::A
MySQL中，可以使用SHOW CREATE DATABASE database_name;命令来查看创建数据库时的SQL语句。（ ）:::A
如果在ALTER语句中忽略了数据库的名称，则默认修改当前数据库。（ ）:::A
DROP DATABASE 会删除数据库的系统目录项，但不会删除包含数据的文件目录。（ ）:::B
MySQL中，可以使用CREATE TABLE IF NOT EXISTS table_name;命令来创建一个表，如果该表已经存在，就不会创建，也不会报错。（ ）:::A
MySQL中，可以使用CHAR和VARCHAR数据类型来存储字符串，其中CHAR是定长的，VARCHAR是变长的。（ ）:::A
在MySQL数据库中，DESC与DESCRIBE两者用法相同，都是用来显示已经建立的数据表文件。（ ）:::B
在MySQL数据库中，将一个Tab表中INTEGER列的名称从A修改成B，可以使用“ALTER TABLE Tab CHANGE A B INTEGER。（ ）:::A
在MySQL数据库中，同时删除多个数据表时，需要使用分号进行分割。（ ）:::B
外键是表中一列或多列的一组，其值能唯一地标识表中的每一行。（ ）:::B
在对表进行查询时，有时对所查询的某些列希望得到的是一种概念而不是具体的数据时，可以使用CASE表达式。（ ）:::A
MySQL中，可以使用%和_两个通配符来进行模糊匹配，其中%表示任意长度的任意字符，_表示单个任意字符。（ ）:::A
在MySQL的SELECT语句中，可以使用DISTINCT消除结果集中的重复行。（ ）:::A
WHERE子句会根据条件对FROM子句的中间结果中的行逐一进行判断，当条件为TRUE时，该行就被包含到WHERE子句的中间结果中。（ ）:::A
MySQL中，可以使用LIMIT 0来查询出空的结果集。（ ）:::A
MySQL中，可以使用IS NULL和IS NOT NULL运算符来判断一个值是否为空。（ ）:::A
在MySQL中，如果没有指定ASC或DESC选项，ORDER BY子句默认按照降序排序。（ ）:::B
在MySQL中，如果使用union操作符连接两个或多个select语句，那么结果集合中的列名通常等于第一个select语句中的列名。（ ）:::A
在MySQL中，如果使用GROUP BY子句对表进行分组，那么SELECT子句中只能出现分组字段或者聚合函数。（ ）:::A
在MySQL的分组条件语句中，having子句是在select子句之前执行，group by子句之后执行的。（ ）:::B
ALTER TABLE命令可用于更改原有表的结构，如：增加或删减列、创建或取消索引、更改原有列的类型、重命名列或表，还可以更改表的评注与表的类型。（ ）:::A
在MySQL中，DROP是 DML 语句，操作完以后如果没有不想提交事务还可以回滚TRUNCATE 和 DELETE是 DDL 语句，操作完马上生效，不能回滚。（ ）:::B
在MySQL中，使用TRUNCATE TABLE语句在功能上与使用WHERE子句的DELETE语句在功能上是相同的。（ ）:::B
在MySQL中，聚合函数常用于对一组值进行计算，然后返回单个值。（ ）:::A
在MySQL中，使用LENGTH()函数可以获取字符串的字符数，而不是字节数。（ ）:::B
在MySQL中，使用DATE_FORMAT()函数可以将日期或时间值格式化为指定的格式。（ ）:::A
在MySQL中，常见的流程控制语句有IF语句、CASE语句、SWITCH语句、LOOP语句、WHILE语句和LEAVE语句。（ ）:::B
笛卡尔积不仅是将各个表中的信息进行排列组合，同时也对信息进行了有效筛选。（ ）:::B
在MySQL中，使用JOIN子句和使用INNER JOIN子句是等价的。（ ）:::A
MySQL中使用左连接时，必须在FROM子句后指定LEFT JOIN关键字。（ ）:::A
MySQL中使用自连接时，可以在SELECT子句中引用同一张表的同一列。（ ）:::A
from子查询可以使用聚合函数和分组函数。（ ）:::A
相关子查询的结果可以作为外部查询的数据源。（ ）:::B
EXISTS子查询可以返回多个值。（ ）:::B
在java.util.List接口的实现类中，元素是有序的并且可以重复。（ ）:::A
在java.util.List接口的实现类java.util.ArrayList所表示的集合中，数据结构底层由数组来实现，能够精确地控制每个元素的插入位置，或者删除某个位置的元素，对元素的随机访问速度特别快。（ ）:::A
LinkedList增删效率比ArrayList高。（ ）:::A
在使用Iterator对集合中的元素进行遍历时,如果调用了集合对象的remove()方法删 除元素,然后继续使用Iterator遍历元素,会出现异常。（ ）:::A
在Java的集合框架中,Set集合是通过键值对的方式来存储对象的。（ ）:::B
在Java集合框架中Map接口的V remove(Object key)移除所有的键值对元素。（ ）:::B
泛型类型必须是引用类型，不能是基本数据类型。（ ）:::A
使用Collections工具类中的sort()方法可以对List集合进行排序。（ ）:::A
Java系统的标准输入对象是System.in，标准输出对象有两个，分别是System.out和System.err。（ ）:::A
File类中的list()方法用于得到所有子目录下的File类型对象。（ ）:::B
字节流只能用来读写二进制文件。（ ）:::A
BufferedReader类的readLine()方法，如果读到流的末尾，该方法返回的结果为null。（ ）:::A
在Java I/O应用中用户可以自定义自己的异常类。（ ）:::A
程序开发者必须创建一个线程去管理内存的分配。（ ）:::B
多线程没有安全问题。（ ）:::A
当线程类所定义的run()方法执行完毕，线程的运行就会终止。（ ）:::A
线程的优先级是不能改变的。（ ）:::B
一个线程让另一个线程不能执行，它可以对第二个线程调用yield()方法。（ ）:::B
使用JDBC的应用程序可以直接与不同的数据库进行连接，而不需要依赖于底层数据库驱动。（ ）:::B
数据库不是JDBC的组成部分。（ ）:::A
对于相同的SQL语句，Statement对象每次执行时，都会对其进行编译。（ ):::A
PreparedStatement是Statement的子接口，用于执行预编译的SQL语句。（ ）:::A
应用程序可以直接与不同的数据库进行连接,而不需要依赖于底层数据库驱动程序。（ ）:::B
TCP是一种用户数据报协议。（ ）:::B
IPv4版本的IP地址使用4个字节来表示，IPv6的IP版本地址使用8个字节来表示。（ ）:::B
Socket是传输层供给应用层的编程接口，是应用层与传输层之间的桥梁 。（ ）:::A
在基于TCP的SOCKET通讯流程中，服务端模块一般会通过connect命令向客户端发起连接请求。（ ）:::B
Socket类的方法 shutdownInput和shutdownOutput的作用是关闭相应的输入、输出流，不关闭网络连接。它将输入、输出流移动到末尾，再没有数据可以读写了，将以后发过来的数据忽略掉。（ ）:::A
由于UDP是面向无连接的协议，可以保证数据的完整性，因此在传输重要数据时建议使用UDP协议。（ ）:::B
java.net包中的DatagramPacket类用于封装UDP通信中发送或者接收的数据。:::A
DatagramSocket类中提供了accept()方法,用于接收数据报包。（ ）:::B
TCP/IP可以提供异构网络之间的互连。（ ）:::A
TCP是一种面向连接的、可靠的传输协议，它使用三次握手来建立连接，并使用数据包确认和重传机制来确保数据的可靠性。（ ）:::A
死锁的产生有四个必要条件：互斥使用、不可抢占、请求和保持、循环等待。（ ）:::A
据Standish Group的统计，软件的缺陷所造成的损失，相当大的部分是由于测试失败所引起的。（ ）:::B
软件部署过程中需要关注的问题有：安装和系统运行的变更管理、构件之间的相依、协调、内容发放、管理异构平台、部署过程的可变更性、与互联网的集成和安全性。（ ）:::A
分布式架构可以理解为“中央集权式”的部署。（ ）:::B
集中式部署是将所有的应用软件都部署在服务器。（ ）:::A
集中式部署的设计原则是便捷性、安全性、可靠性、灵活性。（ ）:::B
集中式部署方案的特点是信息集中共享、访问速度快、维护方便。（ ）:::B
分布式部署环境下，用户使用任务功能都必须连接外部网络，所以外部网络的稳定是用户使用系统的前提。（ ）:::B
分布式部署环境下，数据交换需要经过数据导出、数据传输、数据导入。（ ）:::B
在分布式部署环境下，数据都保存在自己的数据库中，所以数据隔离的程度高，数据备份比较方便。（ ）:::A
远程调试用来查找程序运行中的错误，也可以用来优化程序的性能。（ ）:::A
如果通过调试器执行远程调试或使用进程服务器，则可以在客户端与服务器之间添加中继器。（ ）:::A
用Windows内核调试引擎进行主动内核调试需要两台机器，通过串口、1394接口或USB 2.0连接，属于远程调试。（ ）:::B
直接通过调试器进行远程调试通常是执行远程调试的最佳且最简单的方法。（ ）:::A
Eclipse IDE具备开发和调试的高级特性，使其成为一个全面的工具。（ ）:::A
测试环境的建立是测试工作的基础。（ ）:::A
测试环境适合与否不会影响测试结果的真实性和正确性。（ ）:::B
硬件、网络环境是测试环境中的最基本的两个要素。（ ）:::B
通过虚拟机，可以在单个计算机上并发运行多个操作系统。（ ）:::A
测试策略和测试方法对测试环境的设计没有影响。（ ）:::B
自动化部署需要考虑当前版本部署失败时，能够恢复到上一个版本的状态。（ ）:::A
对测试环境的变更应当形成一个标准的流程，并保证每次变更都是可追溯的和可控的。（ ）:::A
软件测试和软件开发一样，是一个比较复杂的工作过程，如果无章法可循，随意进行测试势必会造成测试工作的混乱。（ ）:::A
单元测试可看作是编码工作的一部分，应该由程序员完成。（ ）:::A
集成测试着重于集成版本的外部接口的行为。（ ）:::A
通过集成测试之后，软件已完全组装起来，接口方面的错误也已排除，确认测试即可开始。（ ）:::A
系统测试的目的是检验被测代码的功能是否正确。（ ）:::B
验收测试是部署软件之前的最后一个测试操作。（ ）:::A
选择回归测试策略应该兼顾效率和有效性两个方面。（ ）:::A
白盒测试通过检查软件内部的逻辑结构，对软件中的逻辑路径进行覆盖测试。（ ）:::A
使用语句覆盖法进行测试用例设计时，能够准确的判断运算中的逻辑关系错误。（ ）:::B
白盒测试的“条件覆盖”标准强于“判定覆盖”。（ ）:::B
软件测试中条件覆盖不一定包含判定覆盖。（ ）:::A
满足“条件组合覆盖”的测试用例是一定满足“判定覆盖”、“条件覆盖”和“判定/条件覆盖”的。（ ）:::A
只要能够达到100%的逻辑覆盖率，就可以保证程序的正确性。（ ）:::B
程序控制流图是描述程序控制流的一种图示方法。（ ）:::A
黑盒测试又称结构测试、透明盒测试、逻辑驱动测试或基于代码的测试。（ ）:::B
边界值分析法是一种典型的白盒测试法。（ ）:::B
错误推测法的缺点是难以系统化，并且过度依赖个人能力。（ ）:::A
因果图法是利用“关键的少数和次要的多数”的原理。（ ）:::B
判定表是由条件桩、动作桩、条件项和动作项组成的。（ ）:::A
通过正交试验法能够减少测试用例数量。（ ）:::A
场景法中的基本流是模拟用户错误的操作流程。（ ）:::B
对于业务流清晰的系统，可以利用功能图法贯穿整个测试案例过程。（ ）:::B
测试用例的设计和编制是软件测试活动中最重要的。（ ）:::A
每一测试用例都有相应的期望结果。（ ）:::A
测试用例可以分为基本事件、非基本事件和异常事件。（ ）:::B
测试结果的可操作性,即测试执行结果的正确性是可判定的，每一个测试用例都应有相应的期望结果。（ ）:::B
测试全面不等于全面测试。（ ）:::A
测试用例按复杂度顺序执行。（ ）:::B
 测试用例集需要不断地变更和维护，使之与产品的变化保持一致。（ ）:::A
 如果让手工做重复的测试，容易引起测试人员的乏味，严重影响工作情绪等。（ ）:::A
 使用测试工具进行测试就等于自动化测试。（ ）:::B
 自动化软件测试工具存在的价值是为了提高测试效率。（ ）:::A
 软件测试按照功能划分可以分为静态测试和动态测试。（ ）:::B
 在投资有限的情况下，性能测试自动化产品将优先于功能测试自动化被考虑。（ ）:::A
 为了最大限度的灵活性，JMeter允许使用正则表达式创建断言。（ ）:::A
 JMeter是Apache组织的开放源代码项目，只能做性能测试。（ ）:::B
 SilkTest是一个可以用于攻击Web应用程序的集成平台。（ ）:::B
 一个完善的缺陷跟踪管理系统对于测试的成功实施是非常重要的。（ ）:::A

 职业道德是从业者在职业活动中应该遵循的符合自身职业特点的（）。:::A

 （ ）是从业者在职业活动中应该遵循的符合自身职业特点的职业行为规范。:::B

 职业道德的真正形成是在（）社会。:::C

 社会主义职业道德的核心思想是（）。:::D

 （）是集体主义精神的最高表现，而坚持集体主义原则则是全心全意为人民服务的本质要求。:::A

 职业道德是社会道德（ ）。:::C

 家庭美德是每个公民在家庭生活中应该遵循的准则，家庭关系包括了（ ）。:::D

 个人的良好的道德品质是（）。:::A

 职业道德行为规范包括职业道德基本行为规范和（ ）。:::B

 职业道德行为规范包括（ ）和职业道德特殊行为规范。:::C

 具有从业人员自身职业特点的职业道德行为准则是（）。:::D

 履行岗位职责的最高表现形式是（）。:::A

 从业人员对爱岗敬业的准确理解应该是（ ）。:::B

 爱岗敬业是职业道德的核心和基础，（ ）不属于爱岗敬业的行为表现。:::C

 敢讲真话，坚持真理，敢于与掺杂使假、坑蒙拐骗的行为做斗争，以实际行动来维护（ ）的道德规范。:::D

 （）就是对待同事，甚至竞争对手谦和礼让、大肚能容，不能小肚鸡肠、斤斤计较。:::A

 党的十九大报告在加强思想道德建设中指出，“要推进诚信建设和志愿者服务制度化，强化（ ）”。:::B

 办事公道要求做到（）。:::C

 办事公道的基本要求不包括（）。:::D

 服务群众的核心内容是（）。:::A

 （ ）体现了从业人员自觉自愿、无私无畏为社会做贡献的人生态度，以为人民服务为乐的精神。:::B

 （ ）体现了从业人员为祖国、为人民竭尽全力，甚至不惜牺牲生命的社会责任感。:::C

 孔子说：“其生正,不令而行,其身不正,虽令不从”，说明了道德行为规范的（）。:::D

 （ ）是指个人在政治、思想、道德品质、知识技能方面，经过学习和自我锻炼所达到的水平。:::A

 做到开拓创新的人，一般是（ ）。:::B

 勤奋学习是指（）。:::C

 已故国家副主席宋庆龄说过“不管你预备走哪一条路,顶顶要紧的是先要为自己做好准备。你不能赤手空拳地开始你的行径,你必须用知识把自己武装起来。”说明了职业道德行为规范的（ ）。:::D

 愚公移山的故事说明了（）。:::A

 正确的职业道德与职业技能的关系是（ ）。:::B

 （）是产品、建设工程、服务行业的生命，也是信誉的先觉条件。:::C

 质量是产品、建设工程、服务行业的生命，也是（ ）的先觉条件。:::D

 （）距今已有近1400年，它经受了洪水冲击、地震摇撼和风化腐蚀等考验，至今仍完整地保持着桥基、桥身的原来结构，宋代杜德源赞誉为“坦平箭直千人过，驿使驰驱万国通。”:::A

 与法律相比，道德具有（）的特点。:::B

 要做到遵纪守法，对每个职工来说，必须做到（ ）。:::C

 文明安全的生产制度是劳动者必须遵守的法律法规、规章制度，是企业实现安全生产的重要（）。:::D

 “单丝不成线、独木不成林”说明了（ ）。:::A

 在充满竞争的现代社会中，正确对待竞争时应该保持的健康心态是（ ）。:::B

 “人心齐，泰山移”，“众人齐心，黄土变金”，这样的雅言俗语都揭示了（）的巨大作用。:::C

 孔子看见他的学生宰予“昼寝”,就说“朽木不可雕也。”其用意是（）。:::D

 “半丝半缕，恒念物力维艰”体现的理念是（ ）。:::A

 荀子讲“强本而节用，则天不能贫。”这句话正确的理解是（ ）。:::B

 计算机程序设计员的职业道德核心原则是应当以（）为最高目标。:::C

 计算机程序设计员利用公司的技术和关系促进自己的业务发展，在职业道德范畴属于（）。:::D

 计算机程序设计员应当积极参与（），紧跟信息技术发展速度，促进职业生涯发展。:::A

 程序设计语言的定义一般包括（）三个方面。:::D

 语义是程序语言中按语法规则构成的各个语法成分的含义，其中（）指编译时可以确定的语法成分的含义。:::A

 （）表示了构成语言的各个记号和使用者的关系，涉及符号的来源、使用和影响。:::B

 （）始于从模拟领域发展起来的Simula，在该语言中首次提出了对象和类的概念。:::D

 （）是基于动作的语言，在这种语言中，计算被看成动作的序列。:::A

 （）是程序操作的对象，具有类型、名称、作用域、存储类别和生存期等属性，在程序运行过程中要为它分配内存空间。:::B

 控制成分指明语言允许表述的控制结构，程序员使用控制成分来构造程序中的控制逻辑，理论上已经证明，可计算问题的程序都可以用（ ）这三种控制结构来描述。:::D

 （）基本包括并、差、交、选择、投影、连接、除法、外连接等，有些查询需要几个基本运算的组合，要经过若干步骤才能完成。:::B

 函数是程序模块的主要成分，它是一段具有独立功能的（）。:::C

 函数的使用涉及三个概念：（ ）。:::D

 函数的定义描述了函数做什么和怎么做，包括两部分（）。:::A

 计算机识别、存储和加工处理的对象被统称为（）。:::B

 数据结构通常是研究数据的（）及它们之间的联系。:::C

 数据结构是一种具有一定逻辑关系，在计算机中应用某种存储结构，并且封装了相应操作的数据元素集合，它包含三方面的内容，逻辑关系、存储关系及（）。:::D

 数据结构有很多种，一般来说，按照数据的逻辑结构对其进行简单的分类，包括（）两类。:::B

 常用的线性结构有线性表、栈、队列、双队列、数组和（）等。:::C

 结点按逻辑关系依次排列形成一条“锁链”的数据结构是（ ）。:::D

 （）的逻辑特征是一个结点元素可能有多个直接前驱和多个直接后继。:::A

 常见的非线性结构有二维数组，多维数组，广义表和（）等。:::B

 （ ）是一种重要的非线性数据结构，直观地看，它是数据元素按分支关系组织起来的结构。:::C

 数据结构中的（）的目的，是为了更有效的处理数据，提高数据运算效率。:::C

 算法研究的目的是为了更有效的处理数据，提高数据运算效率，其中数据的运算是定义在数据的（ ）上。:::D

 算法分析的两个主要方面是（）。:::A

 数据库概念结构设计的任务是在需求分析阶段产生的需求说明书的基础上，按照特定的方法把它们抽象为一个不依赖于任何具体机器的数据模型，即（）。:::A

 概念模型是现实世界的第一层抽象，这一类模型中最著名的模型是（）。:::B

 E-R图是数据库设计的工具之一，它一般适用于建立数据库的（）。:::C

 （）是将概念结构设计阶段完成的概念模型，转换成能被选定的数据库管理系统支持的数据模型。:::D

 在关系数据库设计中，设计关系模式属于数据库设计的（）阶段。:::A

 在关系数据库设计中，将E-R图转换到关系模式时，实体与联系都可以表示成（）。:::B

 嵌入式SQL是一种将SQL语句直接写入C、C++、Java等编程语言的源代码中的方法，在这一方法中，将SQL文嵌入的目标源码的语言称为（）。:::C

 嵌入式SQL的预处理方式，是指（ ）。:::D

 在嵌入式SQL中，为了把集合操作转换成单记录处理方式，引进了（）。:::A

 Oracle的PL/SQL、Microsoft SQL Server的Transcat-SQL、IMB DB2的SQL PL等是对SQL的扩展，使其增加了（）功能。:::B

 过程化SQL程序的基本结构是（）。:::C

过程话SQL的特点是（ ）。:::C
The data（）includes the function of updating data on a database， and retrieving data from a database.:::A
（ ）has become a fact of modern life， with millions of people now shopping on-line.:::B
（ ）of database refers to the protection  of data against unauthorized  disclosure， alteration，or destruction.:::A
When all modules have been completed and tested, （）is performed to ensure that the modules operate together correctly.:::B
（）is the delivery of different services through the Internet, including data storage, servers, databases, networking, and software.:::C
As each application module is completed, it undergoes （ ） to ensure that it operates correctly and reliably.:::A
The line of computing jobs waiting to be run on a computer system might be a （）．The jobs are serviced in the order of their arrival， that is， the first in is the first out．:::A
In（）programming ， the user determines the sequence of instructions to be executed， not the programmer.:::D
Integration （ ）is the process of verifying that the components of a system work together as described in the program design and system design specifications.:::C
（）：The process of identifying and correcting errors in a program.:::A
（）：A location where data can be temporarily store（D）:::C
（ ）：A graphical bar with buttons that perform some of the most common commands.:::B
软件工程是指（）。:::A
一组无逻辑关系的语句在程序中多处出现，为了节省存储空间，把这些语句放在一个模块中，该模块的内聚是（）。:::B
软件工程的基本目标是（ ）。:::B
在软件生存周期中,时间最长、所花费的精力和费用也最多的阶段是（）。:::C
软件生存周期是指（）。:::D
通过程序设计活动求解问题时，通常可分为问题建模、算法设计、编写代码和编译调试四个阶段。（ ）阶段的工作与所选择的程序语言密切相关。:::D
某模块中各个处理元素都密切相关于同一功能且必须顺序执行，前一处理元素的输出就是下一处理元素的输入，则该模块的内聚类型为（）内聚。:::C
某开发小组为某企业开发较大规模的项目，该开发小组已经为同一行业的其他企业开发过类似的项目，且该项目需求变化很少，则最适宜采用（ ）开发过程模型。:::A
螺旋模型是一种（）的软件开发模型。:::B
通常企业在信息化建设时需要投入大量的资金，成本支出项目多且数额大。在企业信息化建设的成本支出项目中，系统切换费用属于（）。:::D
软件工程项目质量管理不包括 （）。:::D
软件开发过程中，项目管理的目标不包括（ ）。:::D
在Java语言中，类名应该使用（）命名法。:::A
在C语言中，函数名应该使用（ ）命名法。:::B
在任何语言中，变量名应该（ ）。:::B
（）不属于良好的编码风格。:::C
良好的编程（）使阅读代码更容易。:::B
编码规范是指（）。:::B
行内注释是指（）。:::C
注释规范是指（）。:::A
文件注释是指（）。:::A
文档规范是指（）。:::B
文档规范的好处有（）。:::C
文档规范的类型有（）。:::D
系统实施的目的是（）。:::D
系统转换最安全的方式是（）。:::A
系统日常运行管理内容中的（ ）是指系统中设置了自动记录功能，能通过自动记录的信息发现或判明系统的问题和原因。:::D
信息系统维护的主要内容包括系统应用程序维护、（）、代码维护、硬件设备维护和文档维护。:::A
信息系统维护的最主要内容之一（），它是指对相应的应用软件及有关文档进行的修改和完善。:::B
系统应用程序维护中的（ ）指的是，使应用软件适应外界环境变化和管理需求变化而进行的修改。:::C
系统维护的重点是系统应用软件的维护工作，按照软件维护的不同性质划分为四种类型，即（）。:::D
为了进一步改善软件系统的可维护性和可靠性，并为以后的改进奠定基础的软件维护称为（）。:::A
根据对各种维护工作分布情况的统计结果，软件维护工作的最主要部分是（）。:::B
（）的目的是为了估计系统的技术能力、工作性能和系统的利用率等，其度量了系统当前的性能并为进一步改善未来的系统提供依据。:::C
在评价一个信息系统时，最重要的是建立评价指标体系，它既包括了信息系统开发运行者，也就是信息系统主体，也包括信息系统的直接用户即信息系统的客体，更包括（ ）。:::D
信息系统的安全保密性评价一般属于系统评价技术指标中的（）评价。:::A
一个优秀的概念设计不包含（   ）。:::C
属于程序设计语言的类型的选项是（）。:::A
用（）来描述算法时，可以采用类似于程序设计语言的语法结构，也易于转换为程序。:::D
用某高级程序设计语言编写的源程序通常被保存为（ ）。:::B
将多个目标代码文件装配成一个可执行程序的程序称为（）。:::D
程序代码编写方案是指（）。:::A
程序代码编写方案的好处有（）。:::D
程序代码编写方案的类型有（）。:::B
自上而下的程序设计方案是指（ ）。:::A
面向对象的程序设计方案是指（ ）。:::A
模块化的程序设计方案是指（ ）。:::A
所谓（）就是可以自由而且免费的使用该软件，并拷贝给别人，而且不必支付任何费用给程序的作者，使用上也不会出现任何日期的限制或是软件使用上的限制。:::D
当您拷贝免费软件给别人的时候，必须将完整的软件档案拷贝给他人，同时（）。:::A
免费软件使用上（ ）。:::B
以“先使用后付费”的方式销售的享有版权的软件是（）。:::C
共享软件使用上（）。:::D
按照软件的授权方式，可以分为商业软件、共享软件和（ ）。:::A
（）被定义为描述其源码可以被公众使用的软件，并且此软件的使用，修改和分发也不受许可证的限制。:::B
开源软件的开发方式通常是（）。:::B
开源软件的优势有（）。:::C
软件许可证是一种（），由软件作者与用户签订，用以规定和限制软件用户使用软件或其源代码的权利，以及作者应尽的义务。:::A
一旦与软件开发商达成协议，签订合同后可终身无限制的使用该软件的许可证是（）。:::B
商业软件许可证是指（ ）。:::A
计算机信息系统的安全保护，应当保障（），运行环境的安全，保障信息的安全，保障计算机功能的正常发挥，以维护计算机信息系统的安全运行。:::B
互联网上的（）是指互联网上一切可能对现存法律秩序和其他公序良俗造成破坏或者威胁的数据、新闻和知识等信息。:::C
（ ）是指编制或者在计算机程序中插入的破坏计算机功能或者毁坏数据，影响计算机使用，并能自我复制的一组计算机指令或者程序代码。:::D
涉及（）的计算机信息系统，不得直接或间接地与国际互联网或其他公共信息网络相连接，必须实行物理隔离。:::A
《互联网信息服务管理办法》对经营性和非经营性互联网信息服务实行以下制度：（ ）。:::B
我国计算机信息系统实行（）保护。:::C
通过（ ）方式是可以合法收集个人信息的。:::C
在公共场所安装图像采集、个人身份识别设备所收集的个人图像、身份识别信息只能用于（）的目的，不得用于其他目的；取得个人单独同意的除外。:::C
以下哪一项收集个人信息的途径是合法的（）。:::C
非法获取、出售公民个人信息，情节严重的（）。:::A
非法收集个人信息的处罚是（ ）。:::C
设立用于非法获取、出售或者提供公民个人信息违法犯罪活动的网站、通讯群组，情节严重的，以非法利用信息网络罪定罪处罚；同时构成侵犯公民个人信息罪的，以（）处罚。:::C
恶意代码传播速度最快、最广的途径是（）。:::D
病毒和木马的出现证明在无线平台上生产恶意代码是有可能的，而且病毒在无线环境下可能传播更快，这属于移动商务面临的（）威胁。:::B
（）不足以说明病毒是网络攻击的有效载体。:::D
网页恶意代码通常利用（）来实现植入并进行攻击。:::B
（）病毒没有自我复制功能。:::A
为了防止电子邮件中的恶意代码，应该由（）方式阅读电子邮件。:::A
（）选项不属于恶意代码分析方法。:::C
（ ）信息不是特洛伊木马所窃取的。:::D
（ ）选项属于恶意代码静态分析技术。:::B
应用安全防护技术，主要包括工业互联网（）安全防护技术和工业应用软件安全防护技术。:::D
下面哪项不属于应用安全（）:::D
工业互联网安全防护内容具体包括：设备安全、控制安全、网络安全、（）和数据安全。:::C
云存储系统通过集群应用和分布式存储技术将大量不同类型的存储设备集合起来协调工作，提供企业级数据存储、管理、业务访问、高效协同的应用系统及存储解决方案。对云存储系统的要求不包括（ ）。:::C
数字信封技术能够（）。:::A
若连接数据库过程中需要指定用户名和密码，则这种安全措施属于（ ）。:::D
网络安全的基本目标包括（）。:::A
（ ）攻击方式是利用网络协议的缺陷或者设计漏洞进行的。:::B
（）加密算法是一种对称加密算法。:::B
国家建立和完善网络（）。:::A
网络运营者应当对其收集的用户信息（），并建立健全用户信息保护制度。:::B
（）是指通过网络收集、存储、传输、处理和产生的各种电子数据。:::A
网络产品、服务的提供者不得设置（）；发现其网络产品、服务存在安全缺陷、漏洞等风险时，应当立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。:::B
国家支持企业、研究机构、高等学校、（）组织参与网络安全国家标准、行业标准的指定。:::D
关键信息基础设施的运营者违反网络安全法第三十五条规定，使用未经安全审查或者安全审查未通过的网络产品或者服务的，由有关主管部门责令停止使用，处采购金额在（ ）罚款；对直接负责的主管人员和其他直接责任人员处一万元以上十万元一下罚款。:::A
通过继承取得著作权的人，不能享有的权利是（）。:::A
专利权的地域性是指在（）拥有法律保护。:::B
含有保护期限不受时间限制的知识产权的是（）。:::B
知识产权法的渊源一般分为两类，是指（）。:::B
发明专利的保护期是20年，起算日期为（）。:::A
一项发明或实用新型获得专利授权的实质条件是（）。:::C
软件设计包括（）两个阶段。:::B
概要设计的目的是确定整个系统的（）。:::D
数据流图用于抽象描述一个软件的逻辑模型,数据流图由一些特定的图符构成。不属于数据流图合法图符的是（）。:::B
概要设计的主要成果是（）。:::C
系统流程图是描述（）的工具。:::D
在数据库设计中，用E-R图来描述信息结构但不涉及信息在计算机中的表示，它是数据库设计的（）阶段。:::B
需求分析是分析员经了解用户的要求,认真细致地调研、分析,最终建立目标系统的逻辑模型并写出（ ）的过程。:::D
E-R图是数据库设计的工具之一，它适用于建立数据库的（）。:::A
螺旋模型是一种将瀑布模型和（）结合起来的软件开发模型。:::B
数据耦合和控制耦合相比,则（）成立。:::B
瀑布模型不适合用于（）的软件开发。:::A
下面不属于软件设计原则的是（）。:::B
当一个模块直接使用另一个模块的内部数据时,这种模块之间的耦合为（）。:::C
概要设计与详细设计衔接的图形工具是（ ）。:::C
SD方法是建立良好程序结构的方法，它提出衡量模块结构质量的标准、块间联系与块内联系，SD方法的最终目标是（）。:::B
在SD方法中全面指导模块划分的最重要的原则是（）。:::D
结构化设计方法是一种基于模块化和自顶向下的设计原则的软件设计方法，它主要使用（ ）图形工具来表示软件结构。:::A
结构化程序设计的一种基本方法是（）。:::D
结构化分析方法（SA法）使用的主要描述工具有（）。:::D
软件结构图的形态特征能反映程序复用率的是（）。:::C
软件层次图（H图）中一个方形的方块代表一个（）。:::A
模块间的调用关系，用联结两模块的（ ）表示。:::C
层次图用来描绘软件的层次结构，很适于在（）设计软件的过程中使用。:::B
结构化设计是一种面向数据流的设计方法，以下不属于结构化设计工具的是（）。:::C
HIPO图中的H图称为（）图。:::D
绘制HIPO图时（ ）步骤是不正确的。:::D
在面向对象设计中，（）是用来描述具有相同的属性和方法的对象的集合:::B
（）开发方法能够兼顾功能和数据。:::D
在面向对象软件开发方法中，类与类之间主要有（）结构关系。:::A
面向对象设计中，“设计抽象的接口”的含义是（）。:::B
面向对象设计的核心是使用（）来进行程序设计。:::A
面向对象设计方法中，开闭原则的含义是（ ）。:::B
面向对象的特征中，（）是指在确定系统的某一部分内容时，应考虑到其它部分的信息及联系都在这一部分的内部进行，外部各部分之间的信息联系应尽可能的少。:::A
以面向对象的特征中，（）是指不同类的对象对同一消息做出不同的响应，或者说，同一个方法在不同的对象中有不同的实现方式。:::D
（）是表达系统类及其相互联系的图示，它是面向对象设计的核心，建立状态图、协作图和其他图的基础。:::C
对象实现了数据和操作的结合，使数据和操作（）于对象的统一体中。:::C
对象的（）是对象的动态特征。:::D
（ ）不属于面向对象分析模型。:::C
开发视图描述软件在开发环境下的（）。:::A
开发视图关注程序包，不仅包括要编写的（ ），还包括可以直接使用的第三方SDK和现成框架、类库，以及开发的系统将运行于其上的系统软件或中间件。:::B
开发视图一般使用（）、类图和组件来画。:::D
场景视图，又称“（）视图”，它综合所有的视图。:::A
场景表示法与组件逻辑视图非常相似，但它使用（）的连接符来表示对象之间的交互，对象实例使用实线来表达。:::C
场景视图用于刻画构件之间的（），将四个视图有机地联系起来。:::B
概要设计的主要任务是把需求分析得到的系统扩展用例图转换为软件结构和数据结构，建立的是目标系统的（ ）模型。:::A
为了防止软件概要设计的错误传播到开发的后续阶段，在概要设计文档完后，要进行（）。:::B
软件概要设计阶段通常得到（）。:::D
软件详细设计阶段任务是（）。:::A
软件详细设计阶段属于软件生存周期的（）。:::B
详细设计与概要设计衔接的图形工具是（）。:::D
软件详细设计阶段采用自左向右的二维图形结构描述算法的是（ ）。:::C
结构化程序设计主要强调的是（）。:::D
详细设计的结果基本决定了最终程序的（）。:::C
一般来说，详细设计的方法包括结构化设计方法、（）和Jackson方法。:::C
Jackson方法是以（）为基本依据的程序算法设计方法。:::B
Jackson方法可以实现（ ）。:::D
（ ）不是详细设计时使用的工具。:::A
在详细设计阶段，经常采用的工具有（）。:::A
（）工具在软件详细设计过程中不采用。:::D
程序流程图中的“→”代表（）。:::B
程序流程图中的一般包括三种基本结构，（）结构不属于其基本结构。:::D
程序流程图中的菱形表示的是（）。:::C
（）不属于盒图的用途。:::C
盒图中，（ ）结构可以实现先执行后判断的循环。:::D
（）是用作详细设计的工具。:::D
PAD图为（）提供了有力的工具:::D
在PAD图中，（）符号属于PAD图的基本符号。:::B
在PAD图中，（）符号不属于PAD图的基本符号。:::D
程序流程图、N-S图和PAD图是（）使用的表达工具。:::B
PAD图表示的程序结构的执行顺序是 （ ）。:::A
在N-S流程图中，输入/输出、数据处理、条件判断等都由（）框来表示。:::C
定表是分析和表达 （） 的工具。:::A
判定表中贯穿条件项和动作项的一列称为 （）。:::A
判定表中用符号“-”表示 （）。:::A
判定树是用一种 （） 来表示多个条件、多个取值所应采取的动作。:::B
判定树中每个非终端结点包含一个 （ ），对应一次比较。:::A
判定树与判定表相比，其优点是 （ ）。:::B
PDL（过程设计语言）是描述处理过程（）。:::C
过程设计语言(简称PDL)，也称程序描述语言，又称为（）。:::D
过程设计语言是一种用于描述软件系统的行为和结构的语言，它可以分为（ ）。:::A
JACKSON图中一般不包括（ ）。:::D
Jackson图上下层之间的关系是（）。:::B
Jackson程序设计方法是一种面向（）的设计方法。:::A
在流图中，用（）表示语句。:::C
在流图中，用（）表示判断。:::A
程序流图中箭头代表的是（）。:::B
McCabe方法根据程序控制流的复杂程度定量度量程序的复杂程度这样度量出的结果称为程序的（ ）复杂度。:::D
mccabe度量法是一种衡量（ ）复杂度的测量方法。:::A
mccabe复杂性度量又称为（）。:::A
Halstead方法是根据程序中的运算符和（）的总数来度量程序的复杂程度。:::A
Halstead给出了称为（）度量的模型。:::D
halstead方法是一种（ ）度量方法。:::D
Woodward方法是基于（）的度量方法。:::B
Woodward根据技术复杂度将生产技术分（）类。:::A
Woodward方法是一种（）度量方法。:::D
SQL语句中修改表结构的命令是（）。:::C
某关系表有：员工（部门编号，部门名称，员工编号，姓名，性别，年龄），则其主码为（ ）。:::A
数据库做join操作时，至少要涉及到（）张表。:::B
模块详细设计说明书是一种用于描述模块内部结构和逻辑的文档，它通常包括（ ）。:::C
在设计软件的模块结构时,（）不能改进设计质量。:::D
在模块详细设计说明书中，模块接口部分主要描述了（ ）内容。:::B
系统详细需求分析的目的是分析系统在功能上需要 （）。:::A
系统详细需求分析的过程中，需要评估和分拣客户提出的需求点，将其分类纳入功能模块、业务场景中。这个步骤叫做 （）。:::A
系统详细需求分析的过程中，可以采用不同的分析方法对功能模块逐一分析，如功能分解法、快速原型法、建模分析法等。其中，采用UML进行建模的方法叫做 （）。:::A
系统总体方案中,系统开发计划应当确定:系统开发方法、实施阶段的划分、某阶段投入资源的预算和系统开发的（）。:::C
确定系统的总体结构方案和开发次序的是（）阶段。:::B
确定系统的总体方案、开发顺序、资源分配等是在（）阶段完成。:::C
接口设计是软件设计的一个重要方面，它主要包括（ ）的接口设计。:::B
在系统接口设计中，通常使用（）图形工具来表示系统之间的交互关系。:::B
在用户接口设计中，通常使用（ ）图形工具来表示用户界面的布局和元素。:::B
在数据库设计中，用E-R 图来描述信息结构但不涉及信息在计算机中的表示，它是数据库设计的（）阶段。:::B
在关系数据库设计中，设计关系模式是（ ）阶段的任务 。:::C
数据库概念设计的E-R方法中，用属性描述实体的特征,属性在E-R图中,用（）表示。:::D
系统性能设计的过程中，需要进行性能测试来获取系统的性能指标。常用的性能指标有响应时间、并发数、吞吐量和 （）。:::A
系统性能设计的过程中，需要进行性能测试来获取系统的性能指标。常用的性能测试工具有 （ ）。:::A
系统性能设计的过程中，可以使用缓存技术来提高系统的读性能。常用的缓存技术有 （）。:::A
当系统出错时，应该采取的一般步骤是（）。:::B
系统出错处理的目的是（ ）。:::A
系统出错处理的难点在于（）。:::C
在数据库中存储的是（）。:::C
在数据库中，产生数据不一致的根本原因是（）。:::D
在MySQL中，能够创建数据库的SQL语句是（）。:::D
在MySQL创建数据库过程中，一个数据库可以有（）个主数据库文件。:::B
在MySQL数据库中，使用CREATE命令创建数据库时，FILENAME选项定义的是（）。:::D
在MySQL数据库中，创建数据库后，使用（）命令可打开指定数据库。:::A
在MySQL数据库中，使用（）命令可以查看正在使用的数据库。:::B
MySQL中，可以使用（ ）命令来查看当前服务器上的所有数据库。:::A
在数据库创建后，可以使用（）命令来修改数据库的参数。:::C
ALTER DATABASE用于更改数据库的全局特性，上述所有特性是存储在数据库目录的（）文件中。:::D
在MySQL数据库中，用户必须有对数据库进行修改的权限，才可以使用（）修改数据库参数。:::B
MySQL8.0 在删除数据库时为防止出现错误，应加入（）语句。:::A
在MySQL数据库中，如果需要删除已创建的数据库，可以使用（）命令。:::B
MySQL中，可以使用（ ）命令来删除一个数据库。:::A
在MySQL数据库中，，建立表用的命令是 ( )。:::B
MySQL中，可以使用（）命令来创建一个名为student的表，包含id、name、age三个字段。:::A
MySQL中，可以使用（ ）命令来创建一个名为teacher的表，包含id、name、salary三个字段，并根据另一个已存在的表employee的结构来创建。:::A
MySQL中，可以使用（）数据类型来存储一个日期，格式为YYYY-MM-DD。:::A
MySQL中，可以使用（）数据类型来存储一个日期和时间，格式为YYYY-MM-DD HH:MM:SS。:::B
MySQL中，可以使用（）数据类型来存储一个日期和时间，格式为YYYY-MM-DD HH:MM:SS，并且会根据时区和系统时间自动更新。:::D
在MySQL数据库中，查看表结构，可以使用（）关键字。:::D
在MySQL数据库中，修改数据库表结构，可以使用（）关键字。:::D
在MySQL数据库中，使用（）语句可以查看表中列的信息。:::B
在MySQL数据库中，若要在基本表S中增加一列CN（课程名），可用（）。:::D
在MySQL数据库中，如果要修改表的结构，应该使用SQL语言的命令（）。:::C
在MySQL数据库中，能为数据库中表重命名的是（ ）。:::A
在MySQL数据库中，若要删除数据库中已经存在的表S，可用（）命令。:::C
在MySQL数据库中，无法实现删除表对象或表中数据的语句是（ ）。:::C
在MySQL数据库中，在使用DROP命令删除表后，那么该表将会（）。:::A
在MySQL数据库中，如果要从数据库中删除触发器，应该使用SQL语言的命令（） 。:::B
为数据表创建索引的目的是（ ）。:::A
（）约束用来禁止输入重复值。:::A
在MySQL语法中，用来插入数据的命令是（）。:::B
MySQL中，如果要向一个名为student的表中插入一条数据，包含id、name、age三个字段的值，并且要指定插入的位置，可以使用（）命令。:::D
MySQL中，如果要向一个名为course的表中插入一条数据，包含id、name、credit三个字段的值，并且要使用子查询来提供值，可以使用（ ）命令。:::C
在SQL语言命令中，（）命令属于数据查询功能的命令。:::A
在SELECT语句指定列的位置上，使用（）时，表示选择表中所有的列。:::C
当在查询结果中的列使用自己所选择的列标题时，可在列名后使用（）子句来更改查询的列名。:::D
查询数据时可用（ ）代替数据表中的所有字段名。:::A
在SQL语句中，可使用的通配符“_”表示（ ）。:::A
在SELECT语句的WHERE子句的条件表达式中，可以匹配0个到多个字符的通配符是（）。:::D
MySQL中，可以使用（）关键字来去除查询结果中的重复记录。:::B
DISTINCT子句的作用是（）。:::C
MySQL中，如果要对多个字段进行去重，可以使用（）语法。:::A
MySQL中，可以使用（ ）关键字来指定查询条件。:::A
MySQL中，可以使用（）比较运算符来进行查询条件的比较。:::A
如果想查询出所有姓张且出生日期为空的学生的信息，则WHERE条件应为（）。:::C
MySQL中，可以使用（ ）关键字来限制查询结果的数量。:::A
在MySQL中，执行“SELECT * FROM TABLE LIMIT 5,10”的结果是（）。:::C
MySQL中，如果要查询出学生表中最后一条记录，可以使用（）语法。:::A
在MySQL的运算符中，优先级最高的是（）。:::A
MySQL中，可以使用（ ）运算符来进行字符串的连接。:::D
在MySQL中，假如“<>”操作符的两则数据不等，则返回结果为（）。:::C
通过（）SQL语句可以按照id升序排序，且按price字段降序排序。:::C
通过（ ）SQL语句可以按照name字段的降序来排序test1表中的数据。:::B
在MySQL的SELECT语句中，通过（）关键字可对查询数据进行排序。:::B
在MySQL中，使用（）统计函数可以返回表中的行数，不管字段中包含的是NULL值还是非NULL值。:::A
在MySQL中，执行COUNT（*）的作用是（）。:::B
在MySQL中，使用（）统计函数可以返回指定字段的平均值，忽略NULL值。:::C
在MySQL中,（ ）操作符可以用来合并两个或多个select语句的结果集合，并保留重复值。:::B
在MySQL中，（）条件是使用union操作符的必要条件。:::A
在MySQL中,（）操作符可以用来合并两个或多个select语句的结果集合，并删除重复值。:::A
现在MySQL中,（ ）函数可以用来统计分组后的记录数。:::A
在MySQL中,（）关键字可以用来对分组后的结果进行过滤。:::B
在MySQL中,（ ）语句可以用来对emp表按照部门编号进行分组，并统计每个部门的平均工资。:::A
在SELECT语句中只能与GROUP  BY子句配合使用的子句是（ ）。:::A
在MySQL的分组语句中，（）说法能正确地描述了having子句的作用。:::A
在MySQL的GROUP BY中语句中，（）说法正确地描述了having子句和where子句的区别。:::A
CREATE TABLE 与（）一起使用可为新建表复制已有的表的结构。:::C
如果要修改数据表的某一列的默认值，需使用（）命令子句。:::D
SQL集数据查询、数据操纵、数据定义和数据控制等功能为一体，语句ALTER TABLE实现（ ）类功能。:::C
在MySQL中有一张表S的结构为：S（SN，CN，grade），其中SN为学生名，CN为课程名，二者均为字符型；grade为成绩，数值型，取值范围0－100。若要更正王二的化学成绩为85分，则可用（ ） 。:::A
在MySQL中，条件更新的作用是（）。:::A
订单号为6的客户因某种情况退回2本书，请在Sell表中修改订购册数并在退回后，将Book表中该图书的数量增加2本，则可用（ ）。:::D
如果DELETE语句中，省略了WHRE子句，则语句执行结果会是（）。:::A
Drop、Delete 和 Truncate都有删除表的作用，三者区别在于（）。:::C
当需要删除一个表时，可以使用（）语句。:::C
（ ）说法能正确地描述了条件删除和无条件删除的区别。:::A
（）说法能正确地描述了删除语句的作用。:::A
当需要删除表中所有记录，且记录有很多条时，可以使用（）命令来快速实现。:::C
在MySQL中，（）函数可返回表中指定字段的平均值。:::C
在MySQL中，（ ）函数属于比较运算函数。:::D
SELECT ROUND（3.14,3）执行的结果是（）。:::A
在MySQL中，（）函数能实现多个字符串连接操作。:::B
在MySQL中，（）函数属于字符串处理函数。:::C
在MySQL中，执行 SELECT UPPER("hello"),LOWER("Hello") FROM STU语句后，运行结果是（）。:::D
在MySQL常用日期函数中，（）返回当前的日期和时间。:::B
在MySQL中，执行（ ）SQL语句可以返回指定日期的星期几的名称。:::A
执行SELECT DATEDIFF('2023-02-05','2018-05-16') AS DifferDate语句后，返回（）。:::D
在MySQL中，用于创建一个带有条件判断的循环过程的语句是（）。:::C
在MySQL中，进行循环操作不具备判断功能的是（）。:::C
在MySQL中，执行SELECT  IF(2*4>9-5,'是','否')后，会返回（）。:::A
在MySQL中，对两张表进行连接查询时，其笛卡尔积的列数、行数分别是（ ）。:::B
在MySQL中执行（）SQL语句可以产生笛卡尔积。:::A
表A中的每一个元素，都对表B中的所有元素做连接运算是（）连接。:::C
在MySQL多表查询时，指定了（）关键字的连接就是内连接。:::B
在MySQL中，正确使用内连接来连接多于两张的表的语法是（ ）。:::C
内连接是在FROM子句产生的中间结果中应用（）条件后，所得到的结果。:::B
MySQL中使用左连接时，如果右表中没有匹配的记录，那么结果集中会显示（）。:::B
在MySQL中，左外连接查询时，使用（ ）设置主表和从表连接的条件。:::B
在MySQL中，（）不属于连接类型。:::C
使用交叉连接后，每条记录中含有的字段数等于（）。:::C
现有三个表，TABLE 1中有10行、TABLE 2中有2行、TABLE 3中有6行，那么这三个表进行交叉连接后，结果集中共用（）行数据。:::D
多个表交叉连接时，在 FROM 后连续使用（）即可。:::D
MySQL中使用自连接时，必须给表起（）。:::A
MySQL中使用自连接时，可以使用（ ）连接类型。:::C
MySQL中使用自连接时，可以在ON子句中使用（）运算符。:::C
条件子查询可以嵌套在（）子句中。:::C
（）子查询用于进行一个给定值是否在子查询结果集中的判断。:::B
条件子查询可以嵌套（）层。:::D
在MySQL中，FROM子查询可以返回（）类型的结果。:::D
FROM子查询必须给子查询结果起一个（ ）。:::A
FROM子查询是指在（）子句中使用子查询作为数据源。:::B
相关子查询的特点是（）。:::A
在SQL语句中，子查询的作用是（）。:::D
相关子查询通常在（）子句中引用了外部查询的表。:::C
使用 EXISTS关键字，判断子查询结果为空时，返回（ ）。:::B
只要子查询中至少返回一个值，则EXISTS语句的值就为（）。:::A
使用EXISTS语句可以测试集合是否为空，EXISTS语句通常与（）结合在一起使用。:::A
Java语言中,集合类都位于（）包中。:::A
List接口是Java集合框架中的一个重要组成部分，它继承自（）接口。:::A
ArrayList是List接口的一个实现类，它使用数组来存储元素，它的初始容量是（）。:::C
ArrayList类的底层数据结构是（）。:::A
ArrayList提供了一些用于操作数组元素的方法，其中（）方法可以将一个集合中的所有元素添加到ArrayList的末尾。:::A
LinkedList除了实现了List接口，还实现了（）两个接口。:::A
在Java中，用于创建链表数据结构的对象的类是（）。:::A
LinkedList提供了一些用于操作链表元素的方法，其中（）方法可以将一个元素插入到链表的头部。:::A
使用Iterator时,（）方法是用来判断是否存在下一个元素。:::A
Iterator接口是Java集合框架中的一个重要组成部分，它用于遍历集合中的元素，它有（ ）两个基本方法。:::A
Iterator接口有一个扩展接口ListIterator，它可以遍历List接口的实现类，它有（）额外的方法可以实现双向遍历。:::A
Set接口是Java集合框架中的一个重要组成部分，它用于存储不重复的元素，它继承自（）接口。:::B
Set接口有多种实现类，其中（）实现类是基于哈希表的，可以保证元素的插入顺序。:::B
要想在集合中保存没有重复的元素并且按照一定的顺序排序，可以使用（）集合。:::D
下列集合中的核心接口中，用于存储一组键值对象,提供键到值的映射的是（）:::D
HashMap是（ ）。:::A
HashMap的底层实现的数据结构是（）。:::D
Java泛型的本质是（）。:::A
在泛型方法中，类型参数声明部分放在（）。:::A
Java泛型中的通配符?表示（）。:::B
下面类或者接口中，（ ）不属于集合框架中的容器。:::A
Map接口有多种实现类，其中（）实现类是基于哈希表的，可以保证键值对的插入顺序。:::B
Map接口提供了一些用于操作映射关系的方法，其中（）方法可以返回一个包含所有键的Set视图。:::A
Java输入、输出流相关的接口和类都位于（）包中。:::B
Java的IO是（）。:::D
Java的IO概念是指（ ）:::A
在Java的File类常用方法中，（）方法是用来用来判断File对象对应的文件或目录是否是绝对路径。:::B
File类的listFiles()方法的返回值是（）类型。:::B
File类的createNewFile()方法的作用是（）。:::A
字节流的基类是（）两个类。:::A
在OutputStream类的常用方法中，向输出流写入一个字节的是（ ）方法。:::C
Java中FileInputStream类的父类是（）。:::D
字符流的基类是（）两个类。:::B
FileReader和FileWriter的构造方法有（）参数。:::A
FileReader和FileWriter是（）类型的流。:::B
BufferedWriter是（）类型的流。:::D
BufferedReader有（）特有的方法:::B
BufferedWriter有（）特有的方法。:::D
I/O异常的常见子类有（）。:::A
在异常处理时,进行释放资源、关闭文件等操作需要的语句是（）。:::C
I/O异常的基类是（ ）类。:::B
进程和线程的区别是（）。:::A
在Java中，创建线程的两种常见方式是（）:::A
java中控制线程的状态的方法有（ ）。:::C
使用继承Thread类的方式创建线程时，必须重写（）方法。:::B
使用实现Callable接口的方式创建线程时，必须实现（）方法。:::C
使用实现Runnable接口的方式创建线程时，必须实现（）方法。:::B
运行状态的线程调用（）方法后会进入等待状态。:::B
新建状态的线程调用（）方法后会进入就绪状态。:::A
等待状态的线程调用（ ）方法后会进入就绪状态。:::D
Java语言中提供了一个（）线程，自动回收动态分配的内存。:::D
Java的线程优先级的默认值是（）。:::B
Java的线程调度是基于（）机制的。:::C
Java的线程优先级可以用（ ）方法设置。:::A
下列锁机机制中，（）不能保证线程安全。:::C
Java的线程优先级可以用（）方法获取。:::A
线程同步的目的是（）。:::C
synchronized关键字可以修饰（ ）元素。:::C
wait()和notify()方法属于（）类。:::B
JDBC中负责驱动管理的是（ ）。:::A
JDBC驱动程序是（）。:::B
所有JDBC驱动程序必须实现的接口是（）。:::A
JDBC提供了一系列访问数据库的接口和类，其中（ ）用于加载JDBC驱动并创建与数据库的连接。:::D
JDBC是（ ）的缩写。:::A
（）不是JDBC驱动程序。:::C
JDBC API使用（）驱动程序来连接数据库。:::B
JDBC API主要位于（）包中。:::A
JDBC API中，（）用来执行SQL语句。:::B
PreparedStatement对象是通过（）方法创建的。:::B
PreparedStatement对象可以用来执行（）类型的SQL语句。:::D
PreparedStatement接口是（ ）接口的子接口。:::B
JDBC执行SQL查询语句的结果放在ResultSet对象中，调用方法（ ）可将指针从当前位置向下移动一行。:::D
ResultSet对象是用来存储（）类型的数据的。:::C
ResultSet对象维护了一个指向当前行的（）。:::A
在JDBC操作中，用于将参数化的SQL语句发送到数据库的方法是（ ）。:::B
接口Statement中定义的executeUpdate方法的返回类型是（）。:::B
接口Statement中定义的execute方法的返回类型是（ ）。:::C
executeQuery(Stringsql)用于执行SQL中的select语句返回值类型（）。:::C
可以获取结果集（ResultSet）的元数据的方法是（）。:::B
在ResultSet接口内部有一个指向表格数据行的游标（或指针），ResultSet对象初始化时，游标在表格的第一行之前，调用（ ）方法可将游标移动到下一行。:::C
网络中计算机连接和通信时遵守的规则称为（ ）。:::D
在Java中，通过（）类可以用来创建一个URL对象。:::A
（）是C类IP地址。:::D
在网络协议中，面向连接的的协议是（）。:::A
在Java的InetAddress类中，获取本对象的IP地址,并存放在字节数组中的方法是（ ）。:::B
InetAddress类中（）方法可实现正向名称解析。:::B
在Socket类的常用方法中，用于获取创建Socket对象时指定的服务器的IP地址的是（）。:::C
Java Socket编程中，客户端要连接服务器端，需要使用（）类的对象。:::A
Java ServerSocket的监听方法accept( )方法的返回值类型是（）。:::A
使用Java进行TCP编程时，双方通过Socket打开输入输出流读写数据，我们通过（）方法可以从Socket对象获取输入流。:::A
在开发基于TCP的SOCKET通讯模块时，一般需要编写服务端和（ ）模块。:::A
在开发基于TCP的SOCKET通讯模块时，一般会用（）方法绑定把套接字。:::B
通过ServerSocket对象中的（ ）方法可以用于接收来自客户端的请求。:::A
在ServerSocket类的构造方法中，以端口port创建ServerSocket对象,并等待客户端的连接请求的是（）。:::A
在用Java语言开发基于Socket的通讯程序时，在完成通讯后，应当在服务端和客户端调用套接字的（）方法来关闭套接字。:::A
套接字的类型包括流套接字、数据报文套接字和（ ）。:::D
Socket是（）。:::C
不属于Socket的类型的是（）。:::D
TCP和UDP的传输方式分别是（ ）。:::A
TCP和UDP的首部长度分别是（）字节。:::A
TCP和UDP分别属于TCP/IP协议簇中的（ ）层。:::C
使用流式套接字编程时，为了向对方发送数据，则需要使用（）方法。:::C
使用UDP协议通信时，需要使用（）类把要发送的数据打包，并且用该类对象接收数据。:::C
Java语言支持网络通信的软件都在（）包中。:::B
在Java中，DatagramPacket类用来表示（）。:::A
在Java中，DatagramPacket类的getAddress()方法作用是（ ）。:::C
在Java中进行UDP通信时，在接收端若要获得发送端的IP地址，可以使用DatagramPacket的（）方法。:::A
在DatagramSocket类的常用方法中，（）方法用于发送 DatagramPacket数据报,将数据报中包含的报文发送到p指定的IP地址的主机。:::C
使用UDP协议进行通信，在程序运行时，DatagramSocket的（ ）方法会发生阻塞。:::B
在Java中使⽤（）类建⽴⼀个socket，⽤于不可靠的数据报的传输。:::B
在TCP/IP模型中，应用层包含了所有的高层协议，在下列的一些应用协议中，能够实现本地与远程主机之间的文件传输工作的是（）:::B
TCP/IP通讯协议采用了4层的层级结构，其中包括应用层、传输层、网络层和（）。:::D
TCP/IP应用层的协议包括：TFTP、（）、SNMP、FTP、SMTP、DNS、Telnet等。:::A
在Java中，使用Socket对象进行TCP通信时，可以通过（ ）方法获取一个输出流，用于向对方发送数据:::A
在Java中，使用Socket类创建客户端对象时，需要传入服务器端的（）。:::A
在TCP/IP 网络中，为各种公共服务和系统保留的端口号范围是（）:::C
Java死锁产生的四个必要条件是（）。:::A
使用（）命令来检测Java程序中是否存在死锁。:::D
避免死锁的一个常用方法是（ ）。:::D
软件（）以及软件向各个结点的部署的工作被称为软件部署。:::A
软件部署是一个复杂过程，包括从开发商发放产品，到应用者在他们的计算机上实际安装并维护应用的所有活动。这些活动包括开发商的软件打包，企业及用户对软件的安装、（）等。:::C
软件部署存在着风险，一般由以下原因造成的：应用软件越来越复杂，包括许多构件、版本和变种；应用发展很快，相继两个版本的间隔很短；（）；构件的来源多样性等。:::D
软件部署过程的主要特征有：过程覆盖度、（）和模型抽象。:::A
抽象的软件部署模型，用于有效地指导部署过程，包括（ ）、企业模型、站点模型、策略模型和部署模型。:::B
企业级软件部署一般可以通过组策略来为域内的用户与计算机部署软件，此类软件的部署分为（）两种。:::C
通过组策略来为域内部署企业级软件主要包括：将软件指派给用户、将软件指派给计算机、将软件发布给用户、（）。:::D
在软件产品部署过程中，（）环节通常包括对用户进行培训和提供技术支持。:::D
（）架构可以理解为即将所需的主机资源集中到少数的机台大型服务器中。:::B
集群技术的目的包括提高性能、降低成本、提高可扩展性、 增强（）。:::C
（ ）架构的思想根基是根据业务功能、模块设计或者行政机构的不同，采用相对分散的中小型服务器。:::D
软件产品集中部署其实就是将所有的应用软件都部署在服务器，客户（），通过远程登录应用，保留和本地相同的体验。:::B
（）需要具有非常高的安全性，集中式部署可提供的硬件安全方案包括身份认证技术、防火墙、入侵防御系统等。:::A
（）是将所有的应用软件都部署在服务器,客户不用安装任何软件客户通过远程登录应用,保留和本地相同的体验,实现任何时间、任何地点、采用任何设备、任何网络实时应用。:::D
集中式部署的设计原则是先进性、（）、可靠性、灵活性。:::C
集中式部署的系统，要同时满足多个单位不同需求，需要在格式、流程、表单、权限等设置上具有（）。:::D
由于系统一旦出现故障，将对整个系统的用户造成影响，要求系统具有很高的（ ），并有完整的应急措施，比如采用双机热备等。:::C
集中式部署方案的特点是（）、快速集中部署、维护方便。:::A
集中式部署方案的特点是信息集中共享、（）、维护方便。:::B
（）所有用户共用同一套系统，各种信息和文档的共享变得非常方便，任何个人都可以通过授权方便地获得相关的信息。:::A
软件产品集中式部署方案需要解决的关键技术是（）。:::C
提高集中式部署可靠性的技术是（）。:::B
（）的系统必须具有先进的技术架构及支撑大量用户访问的设计，包括大并发下的缓存技术、页面异步数据交换等互联网技术。:::D
软件产品分布式部署是将（ ）分散的存储于多台独立的机器设备上，采用可扩展的系统结构，利用多台存储服务器分担存储负荷，利用位置服务器定位存储信息，不但解决了传统集中式存储系统中单存储服务器的瓶颈问题，还提高了系统的可靠性、可用性和扩展性。:::A
（）不但解决了传统集中式存储系统中单存储服务器的瓶颈问题，还提高了系统的可靠性、可用性和扩展性。:::C
软件产品分布式部署在实施过程中可以很方便地实行（），降低实施风险，可分单位逐步进行部署，可以在各独立系统上线运行成功的基础上，最后部署交换中心即可。:::B
分布式部署的设计原则：（）、分布式交换、最小授权。:::D
采用（），每个单位都需要部署一套独立的硬件系统和软件系统，前期相对投入较大。:::C
分布式部署环境下，数据交换需要经过数据导出、（）、数据导入。:::A
（ ）部署不但解决了传统集中式存储系统中单存储服务器的瓶颈问题，还提高了系统的可靠性、可用性和扩展性。:::D
分布式部署的特点是危险分散，（），访问速度快，大容量、大负荷能力。:::B
（）的最大优势在于对互联网依赖小、硬件要求较低。:::C
实现分布式部署需要的关键技术是（）。:::A
对称密钥加密算法支持（）。:::B
公钥加密算法支持（ ）。:::D
如果调试器和被调试的程序位于不同的计算机系统中，并且它们通过以太网或其他网络进行通信，那么这种调试方法称为（）。:::B
调试是开发过程很重要的过程，（）是相对于本地调试来讲的。:::A
远程调试可以帮助我们节约时间并提高（），可以使程序运行更加平稳。:::C
远程用户模式调试中（）是远程控制调试会话的计算机。:::D
远程调试不仅仅是调试，还有（ ）的过程。:::A
远程用户模式调试中（）是运行要调试的应用程序的计算机。:::B
（）通常需要在被调试程序所在的系统中运行调试服务器程序。:::C
通过调试器进行远程调试时，实际执行调试的调试器称为调试（）。:::D
通过调试器进行远程调试时，从距离控制会话的调试器称为调试（）。:::A
直接通过（ ）进行远程调试通常是执行远程调试的最佳且最简单的方法。:::D
使用调试器进行调试时，（）是最常用的调试技术之一。:::B
（）是在两台计算机之间中继数据的轻型代理服务器。:::C
远程调试工具主要用于在（）与实际平台间执行一些调试工作。:::A
（）提供功能强大的远程调试工具和功能,用于对在开发环境外部的其他计算机上运行的应用程序进行故障排除。:::B
（）具备开发和调试的高级特性，使其成为一个全面的工具。:::C
（ ）是指为了完成软件测试工作所必需的计算机硬件、软件、网络设备、历史数据的总称。:::D
开发人员的测试环境通常为（）。:::B
经过良好规划和管理的（），可以尽可能的减少环境的变动对测试工作的不利影响，并可以对测试工作的效率和质量的提高产生积极的作用。:::A
配置测试环境是（）的一个重要阶段，测试环境适合与否会严重影响测试结果的真实性和正确性。:::C
在单元测试和集成测试阶段，大部分测试工作是由（）完成的。:::D
在系统测试和验收测试阶段，测试环境必须最大限度地接近（）。:::D
配置测试环境应该满足5个基本要素是:硬件、软件、（ ）、数据准备、测试工具。:::C
硬件、（）是测试环境中的最基本的两个要素。:::A
测试的数据很重要,数据准备包括数据量和（）两个方面。:::B
（）指通过软件模拟的具有完整硬件系统功能的、运行在一个完全隔离环境中的完整计算机系统。:::A
（）整合空闲的系统资源，充分利用硬件资源，节约能源和空间，并能提升系统的运作效率，有利于测试环境的建立和维护。:::B
流行的虚拟机软件有（ ）、Virtual Box和Virtual PC等。:::C
建立独立的测试实验室，不仅使（）更加专业化和规范化，而且可以充分利用资源，提高测试效率，降低测试成本。:::D
通常一个较完善的测试环境均包括标准配置、最佳配置和（）的设备。:::A
压力测试、性能测试、（）应该在标准配置及最佳配置的设备上运行。:::C
根据软件系统的（），获取并审查部署模型和相关信息，从而确定测试环境部署的要求和特点。:::B
通过（）可以了解软件系统架构设计的细节。:::D
软硬件资源到位以后，开始构建测试环境，有时需要较长时间的（ ），最终部署正在开发的系统。:::A
在开发自动（）的时候，需要建立标准化的各种环境部署顺序。:::B
自动化部署的脚本具有良好的（），充分考虑到各种意外情况，回避各种问题的出现，保证自动部署的成功。:::C
自动化部署最理想的部署方式是做到（）。:::D
测试环境的维护和管理，不仅包括硬件设备的保养维护和软件版本的及时升级，更重要的是维护测试环境的（），定期检查软件和网络的配置，做好记录和跟踪，确保测试环境始终符合测试的实际要求。:::A
为了做好测试环境的维护和管理，首先要建立测试环境的管理流程和规章制度，严格的管理流程能够保证和改善测试环境的正确性、（ ）。:::B
对测试环境的变更应当形成一个标准的流程，并保证每次变更都是（）和可控的。:::C
软件测试按照软件从编写到交付的各个阶段按先后顺序可分为：单元测试、（）、确认测试、系统测试、验收测试。:::D
在详细设计和概要设计阶段，确保集成测试计划和（）计划完成。:::A
（）是依据软件的需求规格说明书，指定测试计划和设计相应的测试用例。:::B
对软件中的最小可测试单元进行检查和验证是（）。:::C
静态分析就是对软件的（ ）进行研读，查找错误或收集一些度量数据，并不需要对代码进行编译和执行。:::D
单元测试用于模拟被测模块调用者的模块是（）。:::A
集成测试也叫做（），通常是在单元测试的基础上，将所有模块按照概要设计说明书和详细设计说明书的要求进行组装和测试的过程。:::B
集成测试分为渐增式测试模块和（）。:::C
集成测试计划的主要内容一般不包括（）。:::D
确认测试的目的是要表明软件是可以工作的，并且符合（  ）中规定的全部功能和性能要求。:::A
确认测试又称（ ）。:::B
（）又称有效性测试。:::C
系统测试的目的是（）。:::B
比较常见的、典型的系统测试包括恢复测试、安全测试和（ ）。:::C
验收测试是以（）文档作为测试的基础。:::D
验收测试是技术测试的最后一个阶段，需要和（）共同完成，而且需要在软件实际运行环境上进行测试。:::A
对软件是否能达到用户所期望的要求的测试称为（）。:::B
（ ）是指修改了旧代码后，重新进行测试以确认修改没有引入新的错误或导致其他代码产生错误。:::D
选择回归测试策略应该兼顾效率和（ ）两个方面。:::A
常用的选择回归测试的方式包括：（）、基于风险选择测试、基于操作剖面选择测试、再测试修改的部分等。:::B
白盒测试也称为（）。:::C
白盒测试的方法总体上分为静态分析方法和（ ）方法两大类。:::B
软件测试中白盒测试方法是通过分析程序的（）来设计测试用例的。:::C
语句覆盖的含义是选择足够多的测试数据，使被测程序中每条语句至少执行（）。:::D
语句覆盖法的目标是将所有（）覆盖一次。:::A
语句覆盖是很弱的（）。:::B
判定覆盖也被称为（）。:::C
判定覆盖要求（ ）。:::D
（）中每个判定的每个分支至少执行一次。:::A
使程序中每个判定的每个条件的可能取值至少执行一次的覆盖方式（）。:::A
进行程序测试时，（）是白盒测试方法中最重要的一种方法，也是一种比较好的测试方法，是经常被采用的一种方法。:::B
测试能力中最弱的逻辑覆盖法是（ ）。:::D
（）是设计足够的测试用例，得使判断中每个条件的所有可能取值至少执行一次，同时每个判断本身所有可能结果也至少执行一次。:::C
判定条件覆盖的缺点是忽略了（）的组合情况。:::B
判定条件覆盖是设计足够的测试用例，得使判断中每个条件的所有可能取值至少执行一次，同时每个（）本身所有可能结果也至少执行一次。:::A
（ ）的基本思想是设计足够的测试用例，使得判断中每个条件的所有可能至少出现一次，并且每个判断本身的判定结果也至少出现一次。:::C
满足“（）”的测试用例是一定满足“判定覆盖”、“条件覆盖”和“判定/条件覆盖”的。:::D
条件组合覆盖与（）的差别是它不是简单地要求每个条件都出现“真”与“假”两种结果，而是要求让这些结果的所有可能组合都至少出现一次。:::B
软件测试中路径覆盖必定也满足（ ）。:::A
在白盒测试法中，覆盖程度最高的就是（）。:::D
（ ）使程序中每一条可能的路径至少执行一次。:::C
（）是在程序控制流图的基础上，通过分析控制构造的环路复杂性，导出基本可执行路径集合，从而设计测试用例的方法。:::D
（ ）是描述程序控制流的一种图示方法。:::A
基本路径测试法是在（）的基础上，通过分析控制构造的环路复杂性，导出基本可执行路径集合，从而设计测试用例的方法。:::B
黑盒测试是以（ ）的角度，从输入数据与输出数据的对应关系出发进行测试。:::C
黑盒测试又叫功能测试、（）或基于需求规格说明书的功能测试。:::D
黑盒测试用例设计方法包括等价类划分法、（）、错误推测法、因果图法、判定表驱动法、场景法等。:::A
软件测试中的等价类划分，指的是一种典型的、重要的（）方法。:::C
（）指对于程序规格说明来说，是合理的、有意义的输入数据构成的集合。:::B
在输入条件规定的取值范围或值的个数的情况下，可以确定一个有效等价类和（ ）无效等价类。:::C
边界值分析法是（）测试用例设计方法。:::D
边界值分析法是作为对等价类划分法的补充，这种情况下，其测试用例来自等价类的（）。:::A
边界值分析不仅要考虑输入条件，还要考虑（）空间产生的测试情况。:::B
（）的基本思想: 列举出程序中所有可能有的错误和容易发生错误的特殊情况,根据他们选择测试用例。:::D
（）一般是作为测试用例设计的补充，而不是单独用来设计测试用例。:::B
错误推测法又叫（ ）。:::A
因果图法是一种适合于描述对于多种输入条件组合的测试方法，根据（），分析输入条件的各种组合情况，从而设计测试用例的方法:::C
根据输出对输入的依赖关系设计测试用例的方法是（）。:::D
从用自然语言书写的程序规格说明的描述中找出因和果，从而通过因果图转换为（）。:::A
（）是分析和表达多逻辑条件下执行不同操作的情况的工具。:::B
判定表是由条件桩、动作桩、条件项和（ ）组成的。:::C
判定表的建立包括以下步骤：确定规则的个数；（）；填入条件项；填入动作项，制定初始判定表；简化、合并相似规则或者相同动作。:::A
正交试验法是研究多因素、多水平组合的一种试验法，它是利用（ ）来对试验进行设计。:::D
（）就是为多因素试验、寻求最优水平组合的一种高效率的试验设计方法。:::C
（）是黑盒技术设计测试用例的方法之一。:::C
场景法一般包含基本流和（ ）。:::D
在任何情况下都必须使用（）。经验表明，用这种方法设计出的测试用例发现程序错误的能力最强。:::B
对于参数配置类的软件，要用（）选择较少的组合方式达到最佳效果。:::A
对于业务流清晰的系统，可以利用（ ）贯穿整个测试案例过程。:::D
测试的“深度”与（ ）的数量成比例。:::A
（）构成了设计和制定测试过程的基础。:::B
（）是测试工作的指导，是软件测试必须遵守的准则，更是软件测试质量稳定的根本保障。:::C
测试用例的（）指输入用户实际数据以验证系统是否满足需求规格说明书的要求；测试用例中的测试点应首先保证要至少覆盖需求规格说明书中的各项功能，并且正常。:::D
用例执行粒度尽量保持每个用例都有测点，不能同时覆盖很多功能点，否则执行起来牵连太大，所以每个用例间保持（） 很重要。:::A
测试执行结果的正确性是（ ）  的，每一个测试用例都有相应的期望结果。:::B
测试用例的（），列举执行测试用例的所有输入内容或者条件。:::C
测试用例内容包括测试目标、测试环境、（ ）、测试步骤、预期结果、测试脚本等。:::D
测试用例可以分为基本事件、（） 和异常事件。:::A
测试用例设计必须明确（）和测试分类的程度。:::B
测试结果的可判定性,即测试执行结果的正确性是可判定的，每一个测试用例都应有相应的（ ）。:::C
设计的用例除对测试点本身的测试外，还需考虑用户实际使用的情况、与其他部分关联使用的情况、（） 操作和环境设置等。:::D
覆盖率是度量测试（） 的一个手段，是测试有效性的一个度量。:::A
测试覆盖指测试系统覆盖被测试系统的程度，一项给定测试或一组测试对某个给定系统或构件的所有指定（）进行处理所达到的程度。:::B
测试覆盖是由测试需求和（）的覆盖或已执行代码的覆盖表示的。:::C
测试用例按（ ）顺序执行。:::D
在测试前提符合的情况下，依照（），每一个测试用例都能够顺利地使程序运行，同时呈现相应的期望结果。:::A
测试用例（）越高，被执行的时间越早，执行的频率越高。:::B
在测试过程中发现测试用例未覆盖全部需求时，需要（）测试用例。:::C
如果存在两个或更多测试用例对一组相同的输入和输出进行测试，则需要对其进行（ ）。:::D
测试用例的维护是一个（）的过程，也是一个不断改进和完善的过程。:::A
通过手工测试无法做到覆盖所有（）。:::B
许多与时序、（）、资源冲突、多线程等有关的错误通过手工测试很难捕捉到。:::D
（ ）是由测试工程师手动测试软件各项功能以发现缺陷的过程。:::A
（ ）是把以人为驱动的测试行为转化为机器执行的一种过程。:::B
实施自动化测试之前需要对（）进行分析，以观察其是否适合使用自动化测试。:::C
为了节省人力、时间或硬件资源，提高（），便引入了自动化测试的概念。:::A
自动化软件测试工具是用软件来代替一些人工输入，其存在的价值是为了提高（）。:::D
测试管理工具是为了复用（ ），提高软件测试的价值。:::C
一个好的软件测试工具和测试管理工具结合起来使用将会使软件（）大大的提高。:::B
按测试工具的收费方式，可分为（）。:::C
软件测试工具按照其用途，可分为测试管理、自动化功能测试工具、（）、白盒测试工具。:::D
一般针对代码进行测试，测试中发现的缺陷可以定位到代码级的测试工具是（ ）。:::A
测试工具的选择是（）的一个重要步骤之一。:::B
自动化测试的成功主要在于为不同的需求确定（ ）的工具。:::A
在选择测试工具时，不仅要考虑性能价格比、产品的成熟度，还要考虑测试工具引入的（）。:::C
一般来说，GUI功能测试工具的测试过程包括（）。:::D
（）是一个用于Web应用程序自动化测试工具。:::B
JMeter 能够对应用程序做功能测试与回归测试，通过创建带有（ ）的脚本来验证程序是否返回了期望结果。:::B
压力测试（StressTesting）又称强度测试，其目标是（）。:::C
（）是一种适用于各种体系架构的自动负载测试工具，它能预测系统行为并优化系统性能。:::D
JMeter能够对HTTP和FTP服务器进行压力和性能测试，也可以通过JDBC对任何（）进行同样的测试。:::A
（）是一个可以用于攻击Web应用程序的集成平台。:::A
（）可以支持的常见故障排除问题包括程序包丢失,潜在问题和恶意网络活动。:::B
安全测试是一个非常复杂的过程，安全测试所使用到的工具也非常多，例如（）、端口扫描工具、抓包工具、渗透工具等。:::C
缺陷跟踪管理系统主要完成对（ ）的记录、分析和状态更新等管理。:::D
（）缺陷跟踪系统的主要目标在于为改正那些应该改正的缺陷提供帮助。:::C
在开源项目管理软件中，（）禅道是比较流行的缺陷管理系统之一。:::A
`;
